Repository: porthd/timer
Catalog: Resources/Private/Language/FlexForms/*.locallang_csh_sunrisereltimer.xlf
Languages: de

# sunPosition.title
source: sun position
de: Sonnenstand

# sunPosition.alttitle
source: sun position
de: Sonnenstand

# sunPosition.description
source: You can select one of the following states of the sun: sunrise, sunset, transit or [beginn or end] of [civil, nautical or astronomical] twilight.
de: Wählen sie einen der Sonnenstände: Sonnenaufgang, Sonnenuntergang, Sonnenhöchststand oder [Beginn oder Ende] der [zivilen, nautischen oder astronomischen] Dämmerung.

# sunPosition.details
source: An example: Hold on two hours after the sunrise for three hours in Anus (France). The parameter `sunPosition` would have the value `sunrise`.
de: Ein Beispiel wäre folgendes: Immer zwei Stunden nach dem Sonnenaufgang für drei Stunden in Anus (Frankreich). Der Parameter `sunPosition` wäre in diesem Fall `Sonnenaufgang/sunrise`.

# relMinToSelectedTimerEvent.title
source: time span relaitve to the reference time
de: Abstand zum Bezugszeitpunkt in Minuten

# relMinToSelectedTimerEvent.alttitle
source: time span relaitve to the reference time
de: Abstand zum Bezugszeitpunkt in Minuten

# relMinToSelectedTimerEvent.description
source: In order to define a correct start time, the distance to the start of the reference day is calculated in minutes. As a reminder, an hour is 60 minutes and a day is 1440 minutes. Negative values are also possible. The value must not exceed 444444 minutes.
de: Um einen korrekten Startzeitpunkt zu definieren, wird der Abstand zum Start des Bezugstages in Minuten berechnet. Zur Erinnerung: Eine Stunde dauert 60 Minuten und ein Tag entsprechend 1440 Minuten. Es sind auch negative Werte möglich. Der Werte darf 444444 Minuten nicht überschreiten.

# relMinToSelectedTimerEvent.details
source: An example: Hold on two hours after the sunrise for three hours in Anus (France). The parameter `relMinToSelectedTimerEvent` would have the value 120 (= 2 * 60 minutes).
de: Ein Beispiel wäre folgendes: Immer zwei Stunden nach dem Sonnenaufgang für drei Stunden in Anus (Frankreich). Der Parameter `relMinToSelectedTimerEvent` wäre in diesem Fall 120 (= 2 * 60 Minuten).

# durationMinutes.title
source: duration
de: Zeitdauer

# durationMinutes.alttitle
source: active time span in minutes
de: aktive Zeitspanne in Minuten

# durationMinutes.description
source: The active time span is given in minutes. Negative values, i.e. values reaching into the past, are also permitted. An hour is 60 minutes and a day is 1440 minutes. Negative values are also possible. The value must not exceed 444444 minutes.
de: Die aktive Zeitspannen wird in Minuten angegeben. Es sind auch negative, also in die Vergangenheit reichenden Werte zulässig. Eine Stunde dauert 60 Minuten und ein Tag entsprechend 1440 Minuten. Es sind auch negative Werte möglich. Der Werte darf 444444 Minuten nicht überschreiten.

# durationMinutes.details
source: An example: Hold on two hours after the sunrise for three hours in Anus (France). The parameter `durationMinutes` would have the value 180 (= 3 * 60 minutes).
de: Ein Beispiel wäre folgendes: Immer zwei Stunden nach dem Sonnenaufgang für drei Stunden in Anus (Frankreich). Der Parameter `durationMinutes` wäre in diesem Fall 180 (= 3 * 60 Minuten).

# durationNatural.title
source: sun position at the end of time span
de: Sonnenstand zum Ende der Zeitspanne

# durationNatural.alttitle
source: sun position at the end of time span
de: Sonnenstand zum Ende der Zeitspanne

# durationNatural.description
source: You can select one of the following states of the sun: sunrise, sunset, transit or [beginn or end] of [civil, nautical or astronomical] twilight. It will every time mean the next naturaL sunstate after the beginning sunstate.
de: Wählen sie einen der Sonnenstände: Sonnenaufgang, Sonnenuntergang, Sonnenhöchststand oder [Beginn oder Ende] der [zivilen, nautischen oder astronomischen] Dämmerung. Dieser Sonnenstand kennzeichnet das Ende des Zeitbereichs, wobei der ausgewählte Sonnenstand immer natürlich dem beginnenden Sonnenstand nachfolgt.

# durationNatural.details
source: An example: Hold on the time betwenn sunrise and sunset in Anus (France). The parameter `durationNatural` would have the value `sunset`. (Light for the anus in the world.)
de: Ein Beispiel wäre folgendes: Immer in der Zeit von Sonnenaufgang bis Sonnenuntergang in Anus (Frankreich). Der Parameter `durationNatural` wäre in diesem Fall `Sonnenuntergang/sunset`. (Licht für [den] Anus der Welt).

# latitude.title
source: latitude
de: Breitengard

# latitude.alttitle
source: latitude (numeric value)
de: Breitengrad (in numerischer Darstellung)

# latitude.description
source: The latitude will be used in a numerical way, which is the current standard for positioning in the the web. The values could hab a range from -90 to 90.
de: Der Breitengrad wird numerisch angegeben, wie es im Internet bei Positionsangaben üblich ist. Es sind Werte zwischen -90 und 90 erlaubt.

# latitude.details
source: An example: Hold on two hours after the sunrise for three hours in Anus (France). The parameter `latitude` would have the value 47.599329 (latitude of anus in the world).
de: Ein Beispiel wäre folgendes: Immer zwei Stunden nach dem Sonnenaufgang für drei Stunden in Anus (Frankreich). Der Parameter `latitude` wäre in diesem Fall 47.599329 (Breitengrad für [den] Anus der Welt).

# longitude.title
source: longitude
de: ´Längengrad

# longitude.alttitle
source: longitude (numeric value)
de: Langengrad (in numerischer Darstellung)

# longitude.description
source: The longitude will be used in a numerical way, which is the current standard for positioning in the the web. The values could hab a range from -180 to 180.
de: Die Längengrad wird numerisch angegeben, wie es im Internet bei Positionsangaben üblich ist. Es sind Werte zwischen -180 und 180 erlaubt.

# longitude.details
source: An example: Hold on two hours after the sunrise for three hours in Anus (France). The parameter `longitude` would have the value 3.534787 (longitude of anus in the world).
de: Ein Beispiel wäre folgendes: Immer zwei Stunden nach dem Sonnenaufgang für drei Stunden in Anus (Frankreich). Der Parameter `longitude` wäre in diesem Fall 3.534787 (Längengrad für [den] Anus in der Welt).
