Repository: porthd/timer
Catalog: Resources/Private/Language/FlexForms/*.locallang_csh_periodlisttimer.xlf
Languages: de

# yamlPeriodFilePath.title
source: yaml-file
de: yaml-Datei

# yamlPeriodFilePath.alttitle
source: yaml-file with list of active periods
de: yaml-Datei mit Liste der aktiven Perioden

# yamlPeriodFilePath.description
source: An appointment is defined by the limits of the active start and end time, by a title and if necessary. through additional data in the data block.
de: Ein Termin wird definiert durch die Grenzen der aktiven Start- und Endzeit, durch einen Titel und ggfls. durch weiter Daten im data-Block.

# yamlPeriodFilePath.details
source: # example YAML-structure (remove #)<br /> <pre> periodList: - title: 'winter holidays Bremen' data: description: '- free to fill -' start: '2022-01-31 00:00:00' stop: '2022-02-01 23:59:59' zone: 'Europe/Berlin' </pre>
de: # Beispiel YAML-Struktur (entferne #) <pre> periodList: - title: 'Winterferien Bremen' data: description: '- für freie Texteingabe nutzbar -' start: '2022-01-31 00:00:00' stop: '2022-02-01 23:59:59' zone: 'Europe/Berlin' </pre>

# calendarJsFilePath.title
source: path to file with javascript
de: Pfad zur Javascript-Datei

# calendarJsFilePath.alttitle
source: javascript-framework, that helps to represent events in a calendar
de: Javascript-Framework, das hilft, die Daten von Events in einem Kalender darzustellen

# calendarJsFilePath.description
source: Normally, the calendar view is generated dynamically by transferring the appointment list to the framework in the form of a JSON file.
de: Normalerweise wird die Kalendaransicht dynamisch generiert, indem dem Framework die Terminliste in Form einer JSON-Datei übergeben werden.

# calendarJsFilePath.details
source: The extension comes with a defined version of the `Toast UI Calendar` framework. An independent data processor is used for mapping to the expected JSON structure. If you want to use other frameworks, you have to program appropriate adjustments and data processors. If the JavaScript file or the CSS file is missing, then no calendar view will be created.
de: Die Extension bringt eine defnierte Version von Framework `Toast UI Calender` mit. Für das Mapping auf die erwartete JSON-Struktur wird ein eigenständiger Dataprozessor genutzt. Wenn man andere Frameworks nutzen will, so sind diesbezüglich entsprechende Anpassungen und Dataprozessoren zu programmieren. Wenn die JavaScript-Datei oder auch die CSS-Datei fehlt, dann wird keine Kalendaransicht erzeugt.

# customJsFilePath.title
source: path to file with javascript
de: Pfad zur Javascript-Datei

# customJsFilePath.alttitle
source: javascript-framework, that helps to represent events in a calendar
de: Javascript-Framework, das hilft, die Daten von Events in einem Kalender darzustellen

# customJsFilePath.description
source: Normally, the calendar view is generated dynamically by transferring the appointment list to the framework in the form of a JSON file.
de: Normalerweise wird die Kalendaransicht dynamisch generiert, indem dem Framework die Terminliste in Form einer JSON-Datei übergeben werden.

# customJsFilePath.details
source: The extension comes with a defined version of the `Toast UI Calendar` framework. An independent data processor is used for mapping to the expected JSON structure. If you want to use other frameworks, you have to program appropriate adjustments and data processors. If the JavaScript file or the CSS file is missing, then no calendar view will be created.
de: Die Extension bringt eine defnierte Version von Framework `Toast UI Calender` mit. Für das Mapping auf die erwartete JSON-Struktur wird ein eigenständiger Dataprozessor genutzt. Wenn man andere Frameworks nutzen will, so sind diesbezüglich entsprechende Anpassungen und Dataprozessoren zu programmieren. Wenn die JavaScript-Datei oder auch die CSS-Datei fehlt, dann wird keine Kalendaransicht erzeugt.

# calendarCssFilePath.title
source: path to file with CSS
de: Pfad zur CSS-Datei

# calendarCssFilePath.alttitle
source: Path to file with definition of stylesheets for the framework, that helps to represent events in a calendar
de: Dateipfad für CSS-Definition für das Framework, das hilft, die Daten von Events in einem Kalender darzustellen

# calendarCssFilePath.description
source: Normally, the calendar view is generated dynamically by transferring the appointment list to the framework in the form of a JSON file. The CSS file only styles the output of the calendar template.
de: Normalerweise wird die Kalendaransicht dynamisch generiert, indem dem Framework die Terminliste in Form einer JSON-Datei übergeben werden. Die CSS-Datei styled nur die Ausgabe des Kalendertemplates.

# calendarCssFilePath.details
source: The extension comes with a defined version of the `Toast UI Calendar` framework. An independent data processor is used for mapping to the expected JSON structure. If you want to use other frameworks, you have to program appropriate adjustments and data processors. If the JavaScript file or the CSS file is missing, then no calendar view will be created.
de: Die Extension bringt eine defnierte Version von Framework `Toast UI Calender` mit. Für das Mapping auf die erwartete JSON-Struktur wird ein eigenständiger Dataprozessor genutzt. Wenn man andere Frameworks nutzen will, so sind diesbezüglich entsprechende Anpassungen und Dataprozessoren zu programmieren. Wenn die JavaScript-Datei oder auch die CSS-Datei fehlt, dann wird keine Kalendaransicht erzeugt.

# customCalendarCssFilePath.title
source: path to customized file with CSS
de: Pfad zur benutzerdefinierten CSS-Datei

# customCalendarCssFilePath.alttitle
source: Path to additional customized file with definition of stylesheets for the framework, that helps to represent events in a calendar
de: Dateipfad für zusätzlichen, benutzerdefinierten CSS-Definition für das Framework, das hilft, die Daten von Events in einem Kalender darzustellen

# customCalendarCssFilePath.description
source: Normally, the calendar view is generated dynamically by transferring the appointment list to the framework in the form of a JSON file. The CSS file only styles the output of the calendar template.
de: Normalerweise wird die Kalendaransicht dynamisch generiert, indem dem Framework die Terminliste in Form einer JSON-Datei übergeben werden. Die CSS-Datei styled nur die Ausgabe des Kalendertemplates.

# customCalendarCssFilePath.details
source: The extension comes with a defined version of the `Toast UI Calendar` framework. An independent data processor is used for mapping to the expected JSON structure. If you want to use other frameworks, you have to program appropriate adjustments and data processors. If the JavaScript file or the CSS file is missing, then no calendar view will be created.
de: Die Extension bringt eine defnierte Version von Framework `Toast UI Calender` mit. Für das Mapping auf die erwartete JSON-Struktur wird ein eigenständiger Dataprozessor genutzt. Wenn man andere Frameworks nutzen will, so sind diesbezüglich entsprechende Anpassungen und Dataprozessoren zu programmieren. Wenn die JavaScript-Datei oder auch die CSS-Datei fehlt, dann wird keine Kalendaransicht erzeugt.
