Repository: porthd/timer
Catalog: Resources/Private/Language/FlexForms/*.locallang_csh_generaltimer.xlf
Languages: de

# timeZoneOfEvent.title
source: Timezone
de: Zeitzone

# timeZoneOfEvent.alttitle
source: Timezone
de: Zeitzone

# timeZoneOfEvent.description
source: Define a timezone
de: Definieren Sie eine Zeitzone

# timeZoneOfEvent.details
source: <strong>Concert</strong><br /> A music-band plan an internet-concert in Berlin. The beginning is 20.00 local time. You have to define the timezone and set the toggle `useTimeZoneOfFrontend` to `fixed/active'.<br /><br /><strong>backgroundimige</strong><br /> each morning at 9:00 your website should to change the backgroundimage to induce happy morning-feelings.The effekt should happen in every timezone wolrdwide.You set the toggle `useTimeZoneOfFrontend` to `relative/not-active'.TYPO3 ignores the definition in the field `timeZoneOfEvent` and use the timezone of the frontend.<br /><br />
de: <strong>Konzert</strong><br /> Eine Musikband plant ein Internetkonzert in Berlin. Beginn ist 20.00 Uhr Ortszeit. Sie müssen die Zeitzone definieren und den Toggle `useTimeZoneOfFrontend` auf `fixed/active' stellen.<br /><br /><strong>backgroundimige</strong><br /> Jeden Morgen um 9:00 Uhr soll sich Ihre Website ändern das Hintergrundbild, um fröhliche Morgengefühle hervorzurufen. Der Effekt soll in jeder Zeitzone weltweit auftreten. Den Toggle `useTimeZoneOfFrontend` stellst du auf `relativ/nicht-aktiv'. TYPO3 ignoriert die Definition im Feld `timeZoneOfEvent` und verwendet die Zeitzone des Benutzeroberfläche.<br /><br />

# useTimeZoneOfFrontend.title
source: origin of timezone
de: Ursprung der Zeitzone

# useTimeZoneOfFrontend.alttitle
source: use the timezone from the frontend
de: Zeitzone des Frontends nutzen

# useTimeZoneOfFrontend.description
source: Select the timezone, which TYPO3 use for this timer.
de: Wählen Sie die Zeitzone aus, die TYPO3 für diesen Timer verwendet.

# useTimeZoneOfFrontend.details
source: <strong>Concert</strong><br /> A music-band plan an internet-concert in Berlin. The beginning is 20.00 local time. You have to define the timezone and set the toggle `useTimeZoneOfFrontend` to `fixed/active'.<br /><br /><strong>backgroundimige</strong><br /> each morning at 9:00 your website should to change the backgroundimage to induce happy morning-feelings. The effekt should happen in every timezone wolrdwide. You set the toggle `useTimeZoneOfFrontend` to `relative/not-active'. TYPO3 ignores the definition in the field `timeZoneOfEvent` and use the timezone of the frontend.<br /><br />
de: <strong>Konzert</strong><br /> Eine Musikband plant ein Internetkonzert in Berlin. Beginn ist 20.00 Uhr Ortszeit. Sie müssen die Zeitzone definieren und den Toggle `useTimeZoneOfFrontend` auf `fixed/active' stellen.<br /><br /><strong>backgroundimige</strong><br /> Jeden Morgen um 9:00 Uhr sollte Ihre Website aufgeschaltet werden Ändern Sie das Hintergrundbild, um fröhliche Morgengefühle hervorzurufen. Der Effekt soll in jeder Zeitzone weltweit auftreten. Sie setzen den Schalter `useTimeZoneOfFrontend` auf `relativ/nicht-aktiv'. TYPO3 ignoriert die Definition im Feld `timeZoneOfEvent` und verwendet die Zeitzone des Frontends.<br /><br />

# ultimateBeginningTimer.title
source: Startdate
de: Starttermin

# ultimateBeginningTimer.alttitle
source: Ultimative Startdate
de: Ultimativer Starttermin

# ultimateBeginningTimer.description
source: No active period before this ultimate startdate.
de: Kein aktiver Zeitraum vor diesem endgültigen Startdatum.

# ultimateBeginningTimer.details
source: <strong>Example</strong><br />You define the ultimate start for `2020-01-01 00:00:00` and the ultimate end for `2020-12-31 25:59:59`. The timer is used for your content-element only in the year 2020. Your content-element will be hidden all the time in 2019 and in 2021 or later.
de: <strong>Beispiel</strong><br />Sie definieren den endgültigen Start für „2020-01-01 00:00:00“ und das endgültige Ende für „2020-12-31 25:59“: 59`. Der Timer wird für Ihr Inhaltselement nur im Jahr 2020 verwendet. Ihr Inhaltselement wird die ganze Zeit im Jahr 2019 und im Jahr 2021 oder später ausgeblendet.

# ultimateEndingTimer.title
source: Stopdate
de: Stoptermin

# ultimateEndingTimer.alttitle
source: Ultimative Stopdate
de: Ultimatives Stopdate

# ultimateEndingTimer.description
source: No active period after this ultimate stopdate.
de: Kein aktiver Zeitraum nach diesem endgültigen Stoppdatum.

# ultimateEndingTimer.details
source: <strong>Example</strong><br />You define the ultimate start for `2020-01-01 00:00:00` and the ultimate end for `2020-12-31 25:59:59`. The timer is used for your content-element only in the year 2020. Your content-element will be hidden all the time in 2019 and in 2021 or later.
de: <strong>Beispiel</strong><br />Sie definieren den endgültigen Start für „2020-01-01 00:00:00“ und das endgültige Ende für „2020-12-31 25:59“: 59`. Der Timer wird für Ihr Inhaltselement nur im Jahr 2020 verwendet. Ihr Inhaltselement wird die ganze Zeit im Jahr 2019 und im Jahr 2021 oder später ausgeblendet.
