Repository: porthd/timer
Catalog: Resources/Private/Language/FlexForms/*.locallang_csh_easterreltimer.xlf
Languages: de

# namedDateMidnight.title
source: Named start day
de: Benannter Starttag

# namedDateMidnight.alttitle
source: Reference date name
de: Name des Bezugsdatums

# namedDateMidnight.description
source: The active period is defined relative to the reference date
de: Der aktive Zeitraum wird relativ zu dem Bezugsdatum definiert

# namedDateMidnight.details
source: Easter Sunday is a moveable holiday. Every year, four weeks before the start of Easter Sunday, you want to display a piece of content for three weeks and four days. In this case, the named starting day is Easter.
de: Der Ostersonntag ist ein beweglicher Feiertag. Sie möchten jedes Jahr vier Wochen vorm Beginn des Ostersonntags für drei Wochen und vier Tage ein Content-Element anzeigen lassen. Der benannte Starttag ist in diesem Fall Ostern.

# relMinToSelectedTimerEvent.title
source: time span relaitve to the reference time
de: Abstand zum Bezugszeitpunkt in Minuten

# relMinToSelectedTimerEvent.alttitle
source: time span relaitve to the reference time
de: Abstand zum Bezugszeitpunkt in Minuten

# relMinToSelectedTimerEvent.description
source: In order to define a correct start time, the distance to the start of the reference day is calculated in minutes. As a reminder, an hour is 60 minutes and a day is 1440 minutes. Negative values ​​are also possible. The value must not exceed 444444 minutes.
de: Um einen korrekten Startzeitpunkt zu definieren, wird der Abstand zum Start des Bezugstages in Minuten berechnet. Zur Erinnerung: Eine Stunde dauert 60 Minuten und ein Tag entsprechend 1440 Minuten. Es sind auch negative Werte möglich. Der Werte darf 444444 Minuten nicht überschreiten.

# relMinToSelectedTimerEvent.details
source: Easter Sunday is a moveable holiday. Every year, four weeks before the start of Easter Sunday, you want to display a piece of content for three weeks and four days. The parameter `relMinToSelectedTimerEvent` defines the four weeks with -40320 minutes in this example.
de: Der Ostersonntag ist ein beweglicher Feiertag. Sie möchten jedes Jahr vier Wochen vorm Beginn des Ostersonntags für drei Wochen und vier Tage ein Content-Element anzeigen lassen. Der Parameter `relMinToSelectedTimerEvent` definiert mit -40320 Minuten in diesem Beispiel die vier Wochen.

# calendarUse.title
source: calendar definition
de: Kalenderdefinition

# calendarUse.alttitle
source: Selection of the Western European calendar definition used
de: Auswahl der genutzten westeuropäischen Kalenderdefinition

# calendarUse.description
source: Because of the leap years, there was a calendar reform. In general, today we use the Gregorian calendar. The Orthodox Churches, on the other hand, continue to use the Julian calendar, which leads to deviations in the calculation of public holidays.
de: Wegen der Schaltjahre gabe es eine Kalenderreform. Im Allgemeinen nutzen wir heute den Gregorianischen Kalender. Die orthodoxen Kirchen nutzen dagegen weiterhin den Julianischen Kalender, was bei der Berechnung der Feiertage zu Abweichungen führt.

# calendarUse.details
source: Easter Sunday is a moveable holiday. Every year, four weeks before the start of Easter Sunday, you want to display a piece of content for three weeks and four days. Nothing was said in the example, which is why the Gregorian calendar is assumed in the example.
de: Der Ostersonntag ist ein beweglicher Feiertag. Sie möchten jedes Jahr vier Wochen vorm Beginn des Ostersonntags für drei Wochen und vier Tage ein Content-Element anzeigen lassen. im Beispiel wurde nichts gesagt, weshalb im Beispiel der Gregorianische Kalender unterstellt wird.

# durationMinutes.title
source: duration
de: Zeitdauer

# durationMinutes.alttitle
source: active time span in minutes
de: aktive Zeitspanne in Minuten

# durationMinutes.description
source: The active time span is given in minutes. Negative values, i.e. values ​​reaching into the past, are also permitted. An hour is 60 minutes and a day is 1440 minutes. Negative values ​​are also possible. The value must not exceed 444444 minutes.
de: Die aktive Zeitspannen wird in Minuten angegeben. Es sind auch negative, also in die Vergangenheit reichenden Werte zulässig. Eine Stunde dauert 60 Minuten und ein Tag entsprechend 1440 Minuten. Es sind auch negative Werte möglich. Der Werte darf 444444 Minuten nicht überschreiten.

# durationMinutes.details
source: Easter Sunday is a moveable holiday. Every year, four weeks before the start of Easter Sunday, you want to display a piece of content for three weeks and four days. The parameter `relMinToSelectedTimerEvent` defines the three weeks and four days with 36000 minutes in this example.
de: Der Ostersonntag ist ein beweglicher Feiertag. Sie möchten jedes Jahr vier Wochen vorm Beginn des Ostersonntags für drei Wochen und vier Tage ein Content-Element anzeigen lassen. Der Parameter `relMinToSelectedTimerEvent` definiert mit 36000 Minuten in diesem Beispiel die drei Wochen und vier Tage.
