Repository: porthd/timer
Catalog: Resources/Private/Language/FlexForms/*.locallang_csh_weekdayinmonthtimer.xlf
Languages: de

# nthWeekdayInMonth.title
source: Position of the days of the week within the month
de: Position der Wochentage innerhalb des Monats

# nthWeekdayInMonth.alttitle
source: Position of the days of the week within the month
de: Position der Wochentage innerhalb des Monats

# nthWeekdayInMonth.description
source: A month can have up to five equal weekdays in the month. Accordingly, it is indicated here whether the first, the second, the third, the fourth and/or the fifth weekday of the month is meant.
de: Ein Monat kann bis zu fünf gleiche Wochentage im Monat haben. Entsprechend wird hier angegeben, ob der erster, der zweite, der dritte, der vierte und/oder gegebenenfalls der fünfte Wochentag im Monat gemeint ist.

# nthWeekdayInMonth.details
source: Example: Every penultimate Friday in January and July from 12:00 p.m. for three hours. The parameter `nthWeekdayInMonth` would have the value 2 (= second/penultimate ).
de: Beispiel: Jeden vorletzten Freitag im Monat Januar und Juli ab 12:00 für drei Stunden. Der Parameter `nthWeekdayInMonth` hätte den Wert 2 (= second/vorletzten ).

# activeWeekday.title
source: Active weekday
de: Aktiver Wochentag

# activeWeekday.alttitle
source: Active weekday for selected months
de: Aktiver Wochentag für ausgewählte Monate

# activeWeekday.description
source: One can select up to seven days of the week according to the western calendar: Monday, Tuesday, Wednesday, Thursday, Friday, Saturday and/or Sunday.
de: Man kann gemäß des westlichen Kalenders bis zu sieben Wochentage auswählen: montag, dienstag, Mittwoch, Donnerstag, Freitag, Samstag und/oder Sonntag.

# activeWeekday.details
source: Example: Every penultimate Friday in January and July from 12:00 p.m. for three hours. The `activeWeekday` parameter is mapped to the value `Friday`.
de: Beispiel: Jeden vorletzten Freitag im Monat Januar und Juli ab 12:00 für drei Stunden. Der Parameter `activeWeekday` ist dem Wert `Freitag` zugeordnet.

# startCountAtEnd.title
source: counting direction
de: Zählrichtung

# startCountAtEnd.alttitle
source: Start counting at the end of the month
de: Beginne Zählung am Monatsende

# startCountAtEnd.description
source: Within the month, you can start counting the order within the month at the beginning of the month or at the end of the month. If this switch is on, then counting starts at the end of the month.
de: Innerhalb des Monats kann man die Zählung der Reihenfolge innerhalb des Monats beim Monatsanfang oder beim Monatsende beginnen lassen. Wenn dieser Schalter an ist, dann beginnt die Zählung am Monatsende.

# startCountAtEnd.details
source: Example: Every penultimate Friday in January and July from 12:00 p.m. for three hours. The `startCountAtEnd` parameter is enabled.
de: Beispiel: Jeden vorletzten Freitag im Monat Januar und Juli ab 12:00 für drei Stunden. Der Parameter `startCountAtEnd` ist angeschaltet.

# startTimeSeconds.title
source: start time at selected day
de: Startzeit am ausgewählten Tag

# startTimeSeconds.alttitle
source: start time at selected day
de: Startzeit am ausgewählten Tag

# startTimeSeconds.description
source: The starttime are defined as the seconds after 00:00. The maximum ist 86399. Remark: 24 hours are calculated to 86400 seconds.
de: Die Startzeit berechnet sich ab 00:00 in Sekunden. Der maximale Wert ist 86399. Hinweis: 24 Stunden entsprechen zum Beispiel 86400 Sekunden.

# startTimeSeconds.details
source: Example: Every second last friday in january and july starting at 12:00 for three hours. The parameter `startTimeSeconds` would have the value 43200.
de: Beispiel: Jeden vorletzten Freitag im Januar und Juli ab 12:00 für drei Stunden. Der Parameter `startTimeSeconds` hätte den Wert 43200.

# durationMinutes.title
source: active minutes
de: aktive Minuten

# durationMinutes.alttitle
source: active minutes
de: aktive Minuten

# durationMinutes.description
source: Span of active time in minutes
de: Zeitspanne für aktive Zeit in Minuten

# durationMinutes.details
source: Example: Every second last friday in january and july starting at 12:00 for three hours. The parameter `durationMinutes` would have the value 180 (= 3 * 60 minutes).
de: Beispiel: Jeden vorletzten Freitag im Januar und Juli ab 12:00 für drei Stunden. Der Parameter `durationMinutes` hätte den Wert 180 (= 3 * 60 minutes).

# activeMonth.title
source: Selection of active months
de: Auswahl der aktiven Monate

# activeMonth.alttitle
source: Selection of active months
de: Auswahl der aktiven Monate

# activeMonth.description
source: The counting of the active days of the week can be limited to certain months. If all months are selected, all months are considered. At least one month must be selected. Each month represents a bit in an integer (Jan = 2^0=1; Feb = 2^1=2, Mar= 2^2=4, ..., Dec = 2^11 = 2048)
de: Die Zählung der aktiven Wochentage kann auf bestimmte Monate beschränkt werden. Wenn alle Monate ausgewählt sind, werden alle Monate beachtet. Es muss mindestens ein Monat ausgewählt sein. Jeder Monat repräsentiert ein Bit in einem Integer (Jan = 2^0=1; Feb = 2^1=2, Mrz= 2^2=4, ..., Dez = 2^11 = 2048)

# activeMonth.details
source: Example: Every penultimate Friday in January and July from 12:00 p.m. for three hours. The parameter `activeMonth` would have the value 180 (= 65 = 1[jan] + 64[jul]).
de: Beispiel: Jeden vorletzten Freitag im Januar und Juli ab 12:00 für drei Stunden. Der Parameter `activeMonth` hätte den Wert 180 (= 65 = 1[Jan] + 64[Jul]).
