Repository: porthd/timer
Catalog: Resources/Private/Language/FlexForms/locallang_csh_dateperiodtimer.xlf
Languages: de

# startTimeSeconds.title
source: reference time
de: Bezugszeit

# startTimeSeconds.alttitle
source: reference time
de: Bezugszeit

# startTimeSeconds.description
source: The reference-time defines border of the active time at each weekday.
de: Die Referenzzeit definiert die Grenze der aktiven Zeit an jedem Wochentag.

# startTimeSeconds.details
source: You want to show a content-element from 12:00 to 14:00 every weekday except Saturday and sunday. <br /><br /><strong>How define you it?</strong><br /><em>reference-time</em>: 12:00<br /><em>active minutes</em>: 120<br /><em>weekdays</em>: select Mo, Tu, We, Th, Fr <br /><br />You can although define it from the end.<br /><em>reference-time</em>: 14:00<br /><em>active minutes</em>: -120<br /><em>weekdays</em>: select Mo, Tu, We, Th, Fr <br />
de: Sie möchten ein Inhaltselement von 12:00 bis 14:00 an jedem Wochentag außer Samstag und Sonntag anzeigen. <br /><br /><strong>Wie definieren Sie es?</strong><br /><em>Bezugszeit</em>: 12:00<br /><em>aktive Minuten</em>: 120<br /><em>Wochentage</em>: wählen Sie Mo, Di, Mi, Do, Fr <br /><br />Sie können es aber am Ende definieren.<br /><em>Referenz -Zeit</em>: 14:00<br /><em>aktive Minuten</em>: -120<br /><em>Wochentage</em>: Mo, Di, Mi, Do, Fr auswählen <br />

# durationMinutes.title
source: range of time
de: Zeitdauer

# durationMinutes.alttitle
source: active minutes
de: aktive Minuten

# durationMinutes.description
source: Span of active time in minutes
de: Zeitspanne für aktive Zeit in Minuten

# durationMinutes.details
source: You want to show a content-element from 12:00 to 14:00 every weekday except Saturday and sunday. <br /><br /><strong>How define you it?</strong><br /><em>reference-time</em>: 12:00<br /><em>active minutes</em>: 120<br /><em>weekdays</em>: select Mo, Tu, We, Th, Fr <br /><br />You can although define it from the end.<br /><em>reference-time</em>: 14:00<br /><em>active minutes</em>: -120<br /><em>weekdays</em>: select Mo, Tu, We, Th, Fr <br />
de: Sie möchten ein Inhaltselement von 12:00 bis 14:00 an jedem Wochentag außer Samstag und Sonntag anzeigen. <br /><br /><strong>Wie definieren Sie es?</strong><br /><em>Bezugszeit</em>: 12:00<br /><em>aktive Minuten</em>: 120<br /><em>Wochentage</em>: wählen Sie Mo, Di, Mi, Do, Fr <br /><br />Sie können es aber am Ende definieren.<br /><em>Referenz -Zeit</em>: 14:00<br /><em>aktive Minuten</em>: -120<br /><em>Wochentage</em>: Mo, Di, Mi, Do, Fr auswählen <br />

# periodLength.title
source: period length
de: Periodenlänge

# periodLength.alttitle
source: period length
de: Periodenlänge

# periodLength.description
source: value of the length of the period.
de: Wert der Länge der Periode

# periodLength.details
source: The length of the period is defined in two parameters. The first defines the numerical length of the period. The second define the unit for the numerical value.
de: Die Länge der Periode wird durch zwei Parameter definiert. Die erste Parameter definiert die numerische Länge des Zeitraums. Die Zweite definiert die Einheit, die dem Zahlenwert zuzuordnen ist.

# periodUnit.title
source: period unit
de: Periodeneinheit

# periodUnit.alttitle
source: period unit
de: Einheit für die Periodenlänge

# periodUnit.description
source: unit for the length of the period.
de: Einheit der Länge der Periode

# periodUnit.details
source: The length of the period is defined in two parameters. The first defines the numerical length of the period. The second define the unit for the numerical value.
de: Die Länge der Periode wird durch zwei Parameter definiert. Die erste Parameter definiert die numerische Länge des Zeitraums. Die Zweite definiert die Einheit, die dem Zahlenwert zuzuordnen ist.
