Repository: porthd/timer
Catalog: Resources/Private/Language/*.locallang_flex.xlf
Languages: de

# flexform.timer.txTimerRangeList.sheet.description
source: The active list consists of information in a Yaml file [yamlActiveFilePath] and/or in a list of database references [databaseActiveRangeList]. The resulting ranges are reduced and, if necessary, subdivided by the list of forbidden ranges defined in a Yamle file [yamlForbiddenFilePath] or in a list of database references [databaseForbiddenRangeList]. Example: Every Friday (defined in [yamlActiveFilePath]) except during holidays and public holidays (defined in [yamlForbiddenFilePath]).
de: Die aktiven Liste setzt sich zusammen aus Angaben in einer Yaml-Datei [yamlActiveFilePath] und/oder in einer Liste von Datenbankreferenzen [databaseActiveRangeList]. Die daraus resultierenden Bereichen werden verkleinert und gegebenenfalls unterteilt durch die Liste der verbotenen Bereiche, die in einer Yaml-Datei [yamlForbiddenFilePath] oder in einer Liste von Datenbankreferenzen [databaseForbiddenRangeList] definiert sind. Beispiel: Jeden Freitag (definiert in [yamlActiveFilePath]) außer in den Ferien und an Feriertagen (definiert in [yamlForbiddenFilePath]).

# flexform.timer.rangeListTimer.field.yamlActiveFilePath
source: file-path of yaml-definitions with list of active periods
de: Dateipfad der Yaml-Definitionen mit Liste der aktiven Perioden

# flexform.timer.rangeListTimer.field.yamlForbiddenFilePath
source: file-path of yaml-definitions with list of forbidden periods
de: Dateipfad der Yaml-Definitionen mit Liste verbotener Zeiträume

# flexform.timer.rangeListTimer.field.databaseActiveRangeList
source: list of rows in the database with definitions for active periods
de: Liste der Zeilen in der Datenbank mit Definitionen für aktive Zeiträume

# flexform.timer.rangeListTimer.field.databaseForbiddenRangeList
source: list of rows in the database with definitions for forbidden periods
de: Liste der Zeilen in der Datenbank mit Definitionen für verbotene Zeiträume

# flexform.timer.txTimerSunriseRel.sheet.title
source: sunrise and more
de: Sonnenaufgang und weiteres

# flexform.timer.txTimerSunriseRel.sheet.shortDescr
source: Define an active area relative to different sun positions (sunrise, sunset, ...)
de: Definieren Sie einen aktiven Bereich relativ zu verschiedenen Sonnenständen (Sonnenaufgang, Sonnenuntergang, ...)

# flexform.timer.txTimerSunriseRel.sheet.description
source: Example: Exactly 300 minutes (5 hours) [relMinToSelectedTimerEvent] after sunrise [sunPosition] at the anus of the world, determined by latitude [latitude] and longitude [longitude], the content item is shown for 420 minutes (seven hours) [durationMinutes]. If the time is defined by sunrise [sunPosition] and sunset [durationNatural], then this specification overrides the previous duration definition [durationMinutes].
de: Beispiel: Genau 300 Minuten (5 Stunden) [relMinToSelectedTimerEvent] nach dem Sonnenaufgang [sunPosition] am Anus der Welt, bestimmt durch Breitengrad [latitude] und Längengrad [longitude], wird das Inhaltselement für 420 Minuten (sieben Stunden) [durationMinutes] gezeigt. Wenn die Zeit durch Sonnenaufgang [sunPosition] und Sonnenuntergang [durationNatural] definiert ist, dann übersteuert diese Angabe die vorherige Zeitdauerdefinition [durationMinutes].

# flexform.timer.txTimerSunriseRel.field.latitude.title
source: latitude
de: Breite

# flexform.timer.txTimerSunriseRel.field.longitude.title
source: longitude
de: Längengrad

# flexform.timer.txTimerSunriseRel.field.sunPosition.title
source: relative sunposition timer
de: Relativer Sonnenstand-Timer

# flexform.timer.txTimerSunriseRel.select.sunPosition.defined
source: Active time defined by minute interval and time duration
de: Aktive Zeit definiert durch Minutenabstand und Zeitdauer

# flexform.timer.txTimerSunriseRel.select.sunPosition.sunrise
source: sunrise (= 90°35')
de: Sonnenaufgang (= 90°35')

# flexform.timer.txTimerSunriseRel.select.sunPosition.sunset
source: sunset (= 90°35')
de: Sonnenuntergang (= 90°35')

# flexform.timer.txTimerSunriseRel.select.sunPosition.transit
source: time of highest sun (transition time differ to 12:00)
de: Zeitpunkt der höchsten Sonne (Übergangszeit abweichend von 12:00)

# flexform.timer.txTimerSunriseRel.select.sunPosition.civilTwilightBegin
source: Civil Twilight Begin (= 96°)
de: Bürgerlicher Dämmerungsbeginn (= 96°)

# flexform.timer.txTimerSunriseRel.select.sunPosition.civilTwilightEnd
source: Civil Twilight End (= -96°)
de: Ende der zivilen Dämmerung (= -96°)

# flexform.timer.txTimerSunriseRel.select.sunPosition.nauticalTwilightBegin
source: Nautical Twilight Beginn (= 102°)
de: Nautischer Dämmerungsbeginn (= 102°)

# flexform.timer.txTimerSunriseRel.select.sunPosition.nauticalTwilightEnd
source: Nautical Twilight End (= -102°)
de: Nautisches Dämmerungsende (= -102°)

# flexform.timer.txTimerSunriseRel.select.sunPosition.astronomicalTwilightBegin
source: Astromical Twilight Beginn (= 108°)
de: Astromischer Zwielichtbeginn (= 108°)

# flexform.timer.txTimerSunriseRel.select.sunPosition.astronomicalTwilightEnd
source: Astromical Twilight End (= -108°)
de: Astromisches Zwielichtende (= -108°)

# flexform.timer.txTimerSunriseRel.field.relMinToSelectedTimerEvent
source: minutes relativ to the selected time-marker
de: Minuten relativ zum ausgewählten Zeitmarker

# flexform.timer.txTimerSunriseRel.field.durationMinutes
source: time span between -1340 and +1340 minutes
de: Zeitspanne zwischen -1340 und +1340 Minuten

# flexform.timer.txTimerSunriseRel.field.durationNatural
source: Active duration defined by fixed times or by the distance to the next position of the sun specified here (respect natural order)
de: Aktive Zeitdauer definiert durch feste Zeiten oder durch den Abstand zu nächsten hier festgelegten Sonnenstand (natürliche Reihenfolge beachten)

# flexform.timer.txTimerWeekdayInMonth.sheet.title
source: weekday in Month
de: Wochentag im Monat

# flexform.timer.txTimerWeekdayInMonth.sheet.shortDescr
source: Defines an active range on specific days of the week within selected months
de: Definiert einen aktiven Bereich an bestimmten Wochentagen innerhalb ausgewählter Monate

# flexform.timer.txTimerWeekdayInMonth.sheet.description
source: Example: On every third last [nthWeekdayInMonth + startCountAtEnd] Friday [activeWeekday] in the months of February, May, August and November [activeMonth], the content element is displayed for 120 minutes (2 hours) [negative durationMinutes] until 12:00 (43200 seconds) [startTimeSeconds].
de: Beispiel: An jeden drittletzten [nthWeekdayInMonth + startCountAtEnd] Freitag [activeWeekday] in den Monaten Februar, May, August und November [activeMonth] wird für 120 Minuten (2 Stunden)[negative durationMinutes] bis zum Zeitpunkt 12:00 (43200 Sekunden) [startTimeSeconds] das Inhaltselement angezeigt.

# flexform.timer.txTimerWeekdayInMonth.field.startTimeSeconds
source: starttime
de: Startzeitpunkt

# flexform.timer.txTimerWeekdayInMonth.field.nthWeekdayInMonth
source: position of weekday in the month
de: Position des Wochentages innerhalb des Monats

# flexform.timer.txTimerWeekdayInMonth.select.nthDay.first
source: first weekday of the month
de: erster Wochentag im Monat

# flexform.timer.txTimerWeekdayInMonth.select.nthDay.second
source: second weekday of the month
de: zweiter Wochentag im Monat

# flexform.timer.txTimerWeekdayInMonth.select.nthDay.third
source: third weekday of the month
de: dritter Wochentag im Monat

# flexform.timer.txTimerWeekdayInMonth.select.nthDay.forth
source: forth weekday of the month
de: vierten Wochentag im Monat

# flexform.timer.txTimerWeekdayInMonth.select.nthDay.fifth
source: fifth weekday of the month
de: fünfter Wochentag im Monat

# flexform.timer.txTimerWeekdayInMonth.field.startCountAtEnd
source: Switch ON, if the active weekday(s) should be counted from the end of the month
de: Schalte ON, wenn der(die) aktive(n) Wochentag(e) vom Monatsende her gezählt werden soll(en)

# flexform.timer.txTimerWeekdayInMonth.field.activeWeekday
source: active weekday
de: aktiver Wochentag

# flexform.timer.txTimerWeekdayInMonth.field.activeMonth
source: active month
de: aktiver Monat

# flexform.timer.txTimerWeekdayInMonth.select.activeMonth.january
source: january
de: Januar

# flexform.timer.txTimerWeekdayInMonth.select.activeMonth.february
source: february
de: Februar

# flexform.timer.txTimerWeekdayInMonth.select.activeMonth.march
source: march
de: Marsch

# flexform.timer.txTimerWeekdayInMonth.select.activeMonth.may
source: may
de: kann

# flexform.timer.txTimerWeekdayInMonth.select.activeMonth.june
source: june
de: Juni

# flexform.timer.txTimerWeekdayInMonth.select.activeMonth.july
source: july
de: Juli

# flexform.timer.txTimerWeekdayInMonth.select.activeMonth.october
source: october
de: Oktober

# flexform.timer.txTimerWeekdayInMonth.select.activeMonth.december
source: december
de: Dezember

# flexform.timer.txTimerWeekdayInMonth.field.durationMinutes
source: time span between -1439 and +1439 minutes
de: Zeitspanne zwischen -1439 und +1439 Minuten

# flexform.timer.txTimerWeekdayly.sheet.title
source: active weekdays
de: Aktive Wochentage

# flexform.timer.txTimerWeekdayly.sheet.shortDescr
source: Defines a whole weekday or several whole weekdays as active
de: Definiert einen ganzen Wochentag oder mehrere ganze Wochentage als aktiv

# flexform.timer.txTimerWeekdayly.sheet.description
source: Example: The content item is activated every Friday (Black Friday) [activeWeekday].
de: Beispiel: An jedem Freitag (Black-Friday) [activeWeekday] wird das Inhaltselement aktiviert.

# flexform.timer.txTimerWeekdayly.field.activeWeekday
source: select active weekday(s)
de: Wähle aktive Wochentag oder -tage
