Repository: porthd/timer
Catalog: Resources/Private/Language/*.locallang_flex.xlf
Languages: de

# tca.txTimerSelector.txTimerDaily.select.name
source: time on daily every selected weekday
de: Uhrzeit täglich an jedem ausgewählten Wochentag

# tca.txTimerSelector.txTimerDatePeriod.select.name
source: Period around date every year
de: Zeitraum um Datum jedes Jahr

# tca.txTimerSelector.txTimerEasterRel.select.name
source: Period relativ to Easter and other christian Holydays
de: Zeitraum relativ zu Ostern und anderen christlichen Feiertagen

# tca.txTimerSelector.txTimerJewishHoliday.select.name
source: Period relativ to jewish holydays
de: Zeitraum relativ zu jüdischen Feiertagen

# tca.txTimerSelector.txTimerMoonphaseRel.select.name
source: Timer relativ to the phase of moon
de: Timer relativ zur Mondphase

# tca.txTimerSelector.txTimerMoonriseRel.select.name
source: Timer relativ to calculated moonrise or moonset on referred day
de: Timer relativ zum berechneten Mondaufgang oder Monduntergang beim Bezugstag

# tca.txTimerSelector.txTimerPeriodList.select.name
source: date-list of timespan in yaml-file and helping infos for calendar-representation
de: Terminliste von Zeitspannen in yaml-Datei und Hilfinfos zur Darstellung in Kalenderform

# tca.txTimerSelector.txTimerRangeList.select.name
source: merged list of timer in yaml
de: Zusammengeführte Liste von Timern in yaml

# tca.txTimerSelector.txTimerSunriseRel.select.name
source: period around some sunpositions every day
de: Zeitraum um einige Sonnenstände jeden Tag

# tca.txTimerSelector.txTimerWeekdayInMonth.select.name
source: Active areas filtered by weekday(s), month position(s) and month(s)
de: Aktive Bereiche gefilter über Wochentag(e), Monatsposition(en) und Monat(e)

# tca.txTimerSelector.txTimerWeekdayly.select.name
source: daily for weekdays
de: täglich für Wochentage

# flexform.timer.txTimerDaily.sheet.title
source: daily repeat
de: Täglich wiederholen

# flexform.timer.txTimerDaily.sheet.shortDescr
source: Show on selected days of the week for a specific duration at a defined start or end time
de: Zeige an ausgewählten Wochentagen für eine bestimmten Dauer zu einer definierten Start oder End-Zeit

# flexform.timer.txTimerDaily.sheet.description
source: Example: You want to display a content item starting at 12:00 [startTimeSeconds] for 120 minutes [durationMinutes] on every day of the week except Saturday and Sunday [activeWeekday].
de: Beispiel: Sie möchten ein Inhaltselement ab 12:00 [startTimeSeconds] für 120 Minuten [durationMinutes] an jedem Wochentag außer Samstag und Sonntag [activeWeekday] anzeigen lassen.

# flexform.timer.txTimerDaily.field.startTimeSeconds
source: Reference time for active period
de: Bezugszeitpunkt für aktiven Zeitspanne

# flexform.timer.txTimerDefault.field.nothing.title
source: nothing
de: nichts

# flexform.timer.txTimerDaily.field.durationMinutes
source: time span between -1439 and +1439 minutes
de: Zeitspanne zwischen -1439 und +1439 Minuten

# flexform.timer.txTimerDaily.field.activeWeekday
source: active weekday
de: aktiver Wochentag

# flexform.timer.txTimerJewishHoliday.sheet.title
source: jedish dates related
de: auf jüdischen Daten bezogen

# flexform.timer.txTimerJewishHoliday.sheet.shortDescr
source: Define an active area relative to important jewdish dates such as Yom Kippur or Pesach
de: Definieren Sie einen aktiven Bereich relativ zu wichtigen jüdischen Terminen wie Yom Kippur oder Pesach

# flexform.timer.txTimerJewishHoliday.sheet.description
source: Example: From the beginning of the Yom Kippur festival [namedDateMidnight], exactly 14400 minutes (10 days) [relMinToSelectedTimerEvent] away, a content element is active for a period of 1440 minutes (= 1 day) [durationMinutes].
de: Beispiel: Vom Beginn des Yom Kippur-Festes [namedDateMidnight], genau 14400 Minuten (10 Tage) [relMinToSelectedTimerEvent] entfernt, ist für die Zeit von 1440 Minuten (= 1 Tag) [durationMinutes] ein Inhaltselement aktiv.

# flexform.timer.txTimerJewishHoliday.field.namedDate.title
source: selection of named dates like Yom Kippur
de: Auswahl benannter Feiertage wie Yom Kippur

# flexform.timer.txTimerJewishHoliday.select.namedDate.ShushanPurimPost
source: Shushan Purim (postpone with one day, if the date will meet saturday)
de: Shushan Purim (Verschiebe um einen Tag, wenn er auf Samstag fällt)

# flexform.timer.txTimerJewishHoliday.select.namedDate.ShushanPurimPur
source: Shushan Purim (on saturday too)
de: Shushan Purim (auch am Samstag)

# flexform.timer.txTimerJewishHoliday.field.relMinToSelectedTimerEvent
source: minutes relative to the selected named date
de: Minuten relativ zum ausgewählten benannten Datum

# flexform.timer.txTimerJewishHoliday.field.durationMinutes
source: active time span relative to startpoint in minutes
de: Aktive Zeitspanne relativ zum Periodenstart in Minuten

# flexform.timer.txTimerDatePeriod.sheet.title
source: active datetime-range
de: aktiver Datums-Zeit-Bereich

# flexform.timer.txTimerDatePeriod.sheet.shortDescr
source: Active range relative to a start date time with an adjustable period length
de: Aktiver Bereich relativ zu einer Start-Datum-Uhrzeit mit einstellbarer Periodenlänge

# flexform.timer.txTimerDatePeriod.sheet.description
source: Example: From 1/23/2015 12:35 p.m. [startTimeSeconds] for 120 minutes [durationMinutes] every 5 [periodLength] days [periodUnit]
de: Beispiel: Ab dem 23.1.2015 12:35 [startTimeSeconds] für 120 Minuten [durationMinutes] alle 5 [periodLength] Tage [periodUnit]

# flexform.timer.txTimerDatePeriod.field.startDateTime
source: start of period
de: Beginn der Periode

# flexform.timer.txTimerDatePeriod.field.durationMinutes
source: active time span relative to startpoint in minutes
de: Aktive Zeitspanne relativ zum Periodenstart in Minuten

# flexform.timer.txTimerDatePeriod.field.periodLength
source: period length
de: Periodenlänge

# flexform.timer.txTimerDatePeriod.field.periodUnit
source: period unit
de: Zeitraum Einheit

# flexform.timer.txTimerDatePeriod.selectPeriodUnit.hour
source: hour
de: Stunde

# flexform.timer.txTimerDatePeriod.selectPeriodUnit.day
source: day
de: Tag

# flexform.timer.txTimerDatePeriod.selectPeriodUnit.week
source: week
de: Woche

# flexform.timer.txTimerDatePeriod.selectPeriodUnit.month
source: month (31. may +1M (!= 30 Jun) = 1. Jul)
de: Monat (31. Mai +1M (!= 30. Jun) = 1. Jul)

# flexform.timer.txTimerDatePeriod.selectPeriodUnit.year
source: year
de: Jahr

# flexform.timer.txTimerDefault.sheet.title
source: no timer [default]
de: kein Timer [Standard]

# flexform.timer.txTimerDefault.sheet.shortDescr
source: Example: no period; always active
de: Beispiel: keine Periode; immer aktiv

# flexform.timer.txTimerDefault.sheet.description
source: There ist no timer defined and the timer indicates every time as part of an active range. The starttime and endtime won't be change by the timer-extension.
de: Es ist kein Timer definiert und der Timer indiziert jeden Zeitpunkt als aktive Zeit. Die Start- und Endzeit wird durch die Timer-Erweiterung nicht verändert.

# flexform.timer.txTimerDefault.field.defaultTimer
source: [there are no parameter needed]
de: [es werden keine Parameter benötigt]

# flexform.timer.txTimerEasterRel.sheet.title
source: christian dates related
de: christliche Daten bezogen

# flexform.timer.txTimerEasterRel.sheet.shortDescr
source: Define an active area relative to important Christian dates such as Christmas or Easter Sunday
de: Definieren Sie einen aktiven Bereich relativ zu wichtigen christlichen Terminen wie Weihnachten oder Ostersonntag

# flexform.timer.txTimerEasterRel.sheet.description
source: Example: Exactly 14400 minutes (10 days) [relMinToSelectedTimerEvent] from the beginning of Easter Sunday [namedDateMidnight], according to the Gregorian calendar [calendarUse], a content element is active for a period of 1440 minutes (= 1 day) [durationMinutes].
de: Beispiel: Vom Beginn des Ostersonntags [namedDateMidnight] genau 14400 Minuten (10 Tage) [relMinToSelectedTimerEvent] entfernt ist gemäß des Gregorianischen Kalenders [calendarUse] für die Zeit von 1440 Minuten (= 1 Tag) [durationMinutes] ein Inhaltselement aktiv.

# flexform.timer.txTimerEasterRel.field.namedDate.title
source: selection of named dates like easter
de: Auswahl benannter Feiertage wie Ostern

# flexform.timer.txTimerEasterRel.select.namedDate.goodFriday
source: good friday (*)
de: Karfreitag (*)

# flexform.timer.txTimerEasterRel.select.namedDate.easter
source: easter (*)
de: Ostern (*)

# flexform.timer.txTimerEasterRel.select.namedDate.ascensionOfChrist
source: ascension of Christ (*)
de: Christi Himmelfahrt (*)

# flexform.timer.txTimerEasterRel.select.namedDate.pentecost
source: pentecost (*)
de: Pfingsten (*)

# flexform.timer.txTimerEasterRel.select.namedDate.firstAdvent
source: first advent
de: erste Advent

# flexform.timer.txTimerEasterRel.select.namedDate.christmas
source: christmas
de: Weihnachten

# flexform.timer.txTimerEasterRel.select.namedDate.roseMonday
source: rose monday (*)
de: Rosenmontag (*)

# flexform.timer.txTimerEasterRel.select.namedDate.towlday
source: towl-day
de: Welthandtuchtag

# flexform.timer.txTimerEasterRel.field.relMinToSelectedTimerEvent
source: minutes relative to the selected named date
de: Minuten relativ zum ausgewählten benannten Datum

# flexform.timer.txTimerEasterRel.field.durationMinutes
source: time span between -444444 and +444444 minutes
de: Zeitspanne zwischen -444444 und +444444 Minuten

# flexform.timer.txTimerEasterRel.field.calendarUse.title
source: Use of Calendar for easter
de: Verwendung des Kalenders für Ostern

# flexform.timer.txTimerEasterRel.select.calendarUse.cal_easter_default
source: cal_easter_default (julian for < 1753; gregorian otherwise)
de: cal_easter_default (julianisch für < 1753; sonst gregorianisch)

# flexform.timer.txTimerEasterRel.select.calendarUse.cal_easter_roman
source: cal_easter_roman (julian for < 1583; gregorian otherwise)
de: cal_easter_roman (julianisch für < 1583; ansonsten gregorianisch)

# flexform.timer.txTimerEasterRel.select.calendarUse.cal_easter_always_gregorian
source: cal_easter_always_gregorian (proleptic gregorian for ever)
de: cal_easter_always_gregorian (proleptischer Gregorianer für immer)

# flexform.timer.txTimerEasterRel.select.calendarUse.cal_easter_always_julian
source: cal_easter_always_julian (proleptic gregorian for ever)
de: cal_easter_always_julian (proleptischer Gregorianer für immer)

# flexform.timer.txTimerGeneral.sheet.title
source: Generalities
de: Allgemeines

# flexform.timer.txTimerGeneral.sheet.shortDescr
source: Absolute scope and time zone usage
de: Absoluter Gültigkeitsbereich und Zeitzonenverwendung

# flexform.timer.txTimerGeneral.sheet.description
source: Define the absolute scope of your timer by start and end time. Further define the time zone and its use. Define the general area of activity. Note the following: Before 1583, only the Julian calendar was in use. Britain has only been using the Gregorian calendar since 1752. You need to know what you are doing when using dates before 1752.
de: Definieren sie den absoluten Gültigkeitsbereich ihres Timers durch Start und Endzeit. Definieren Sie weiter die Zeitzone und ihre Verwendung. Definieren Sie den allgemeinen Aktivitätsbereich. Beachten Sie Folgendes: Vor 1583 war nur der Julianische Kalender in Gebrauch. Britannien verwendet den gregorianischen Kalender erst seit 1752. Sie müssen wissen, was Sie tun, wenn Sie Daten vor 1752 verwenden.

# flexform.timer.txTimerGeneral.field.timeZoneOfEvent
source: time-zone of event
de: Zeitzone des Ereignisses

# flexform.timer.txTimerGeneral.field.useTimeZoneOfFrontend
source: fixed timezone
de: feste Zeitzone

# flexform.timer.txTimerGeneral.field.useTimeZoneOfFrontend.toggle
source: off=fixed timezone for event, on=timezone everytime defined by frontend user
de: aus=fest definierte Zeitzone für Ereignis, an=Zeitzone wird dynamisch definiert durch Frontend-Nutzer

# flexform.timer.txTimerGeneral.toggle.frontendRelated
source: no, defined by frontend
de: Nein, definiert durch Frontend

# flexform.timer.txTimerGeneral.toggle.fixedByFlexform
source: yes, defined in field `timeZoneOfEvent`
de: ja, definiert im Feld `timeZoneOfEvent`

# flexform.timer.txTimerGeneral.field.ultimateBeginningTimer
source: Beginning of the period for calculations of the timer periods
de: Beginn des Zeitraums für Berechnungen der Perioden des Timers

# flexform.timer.txTimerGeneral.field.ultimateEndingTimer
source: Ending of the period for calculations of the timer periods
de: Beginn des Zeitraums für Berechnungen der Perioden des Timers

# flexform.timer.txTimerGeneral.select.activeWeekday.monday
source: monday
de: Montag

# flexform.timer.txTimerGeneral.select.activeWeekday.tuesday
source: tuesday
de: Dienstag

# flexform.timer.txTimerGeneral.select.activeWeekday.wednesday
source: wednesday
de: Mittwoch

# flexform.timer.txTimerGeneral.select.activeWeekday.thursday
source: thursday
de: Donnerstag

# flexform.timer.txTimerGeneral.select.activeWeekday.friday
source: friday
de: Freitag

# flexform.timer.txTimerGeneral.select.activeWeekday.saturday
source: saturday
de: Samstag

# flexform.timer.txTimerGeneral.select.activeWeekday.sunday
source: sunday
de: Sonntag

# flexform.timer.txTimerMoonriseRel.sheet.title
source: moonrise
de: Mondaufgang

# flexform.timer.txTimerMoonriseRel.sheet.shortDescr
source: Define an active area with a specific time offset relative to moonrise or moonset
de: Definieren Sie einen aktiven Bereich mit einem bestimmten Zeitabstand relativ zum Mondaufgang oder zum Monduntergang

# flexform.timer.txTimerMoonriseRel.sheet.description
source: Example: 300 minutes (5 hours) [relMinToSelectedTimerEvent] after the moonrise [moonStatus] in Bremen, defined by longitude [longitude] and latitude [latitude], the content element is active for 420 minutes (7 hours) [durationMinutes].
de: Beispiel: 300 Minuten (5 Stunden) [relMinToSelectedTimerEvent] nach dem Monaufgang [moonStatus] in Bremen, definiert durch Längengrad [longitude] und Breitengrad [latitude], ist das Inhaltelement für 420 Minuten (7 Stunden) [durationMinutes] aktiv.

# flexform.timer.txTimerMoonriseRel.field.moonStatus.title
source: status of moon
de: Status des Mondes

# flexform.timer.txTimerMoonriseRel.select.moonStatus.moonrise
source: moonrise
de: Mondaufgang

# flexform.timer.txTimerMoonriseRel.select.moonStatus.moonset
source: moonset
de: Monduntergang

# flexform.timer.txTimerMoonriseRel.field.relMinToSelectedTimerEvent
source: minutes relativ to the selected moon-status
de: Minuten relativ zum gewählten Mondstand

# flexform.timer.txTimerMoonriseRel.field.durationMinutes
source: time span between -1439 and +1439 minutes
de: Zeitspanne zwischen -1439 und +1439 Minuten

# flexform.timer.txTimerMoonriseRel.field.latitude.title
source: latitude
de: Breite

# flexform.timer.txTimerMoonriseRel.field.longitude.title
source: longitude
de: Längengrad

# flexform.timer.txTimerMoonphaseRel.sheet.title
source: Moonphase
de: Mond Phase

# flexform.timer.txTimerMoonphaseRel.sheet.shortDescr
source: Define the active period of time, starting relative to 12:00 am of the day when the moon phases (full moon, waning crescent, new moon, waxing crescent) occur.
de: Definieren Sie die aktive Zeitspanne, die relativ zu 0:00 Uhr des Tages startet, an welchen die Mondphasen (Vollmon, abnehmender Halbmond, Neumond, zunehmender Halbmond) stattfindet.

# flexform.timer.txTimerMoonphaseRel.sheet.description
source: Example: Exactly 3600 minutes (two days and twelve hours) [relMinToSelectedTimerEvent] after the beginning of each day with the waning crescent moon [moonPhase], the content item is active for 200 minutes (three hours and 20 minutes) [durationMinutes].
de: Beispiel: Genau 3600 Minuten (zwei Tage und zwölf Stunden) [relMinToSelectedTimerEvent] nach Beginn jeden Tages mit dem abnehmenden Halbmond [moonPhase] ist das Inhaltselement für 200 Minuten (drei Stunden und 20 Minuten) [durationMinutes] aktiv.

# flexform.timer.txTimerMoonphaseRel.field.moonPhase.title
source: moonphase
de: Mond Phase

# flexform.timer.txTimerMoonphaseRel.select.moonPhase.newMoon
source: new moon
de: Neumond

# flexform.timer.txTimerMoonphaseRel.select.moonPhase.firstQuarter
source: half filled moon
de: zunehmender Halbmond

# flexform.timer.txTimerMoonphaseRel.select.moonPhase.fullMoon
source: full moon
de: Vollmond

# flexform.timer.txTimerMoonphaseRel.select.moonPhase.thirdQuarter
source: half emptied moon
de: abnehmender Halbmond

# flexform.timer.txTimerMoonphaseRel.field.relMinToSelectedTimerEvent
source: starttime defined by the distance in minutes relative to the beginning of the day with the selected moon phase
de: Startzeitpunkt definiert durch den Abstand in Minuten relativ zum Beginn des Tages mit der gewählten Mondphase

# flexform.timer.txTimerMoonphaseRel.field.durationMinutes
source: time span between -14400 and +14400 minutes
de: Zeitspanne zwischen -14400 und +14400 Minuten

# flexform.timer.periodListTimer.field.yamlPeriodFilePath.label
source: local path or link to the file with list of timers in yaml-format
de: Lokaler Pfad oder Link zur Datei mit der Lister der Termine im YAML-Format

# flexform.timer.periodListTimer.field.yamlPeriodFilePath.description
source: The local path can be defined relatively or it is defined in the TYPO3-specific EXT: notation. A link must begin with `http://` or `https://`. If the server is protected by a password, then the username and password must be stored in the same way as in the following example: `MyUsername:MyPassword:http://my-link.de/MyPeriodList.yaml`. (The yaml import command does not work for a link to a yaml file.)
de: Der lokale Pfad kann relativ definiert sein oder er wird in der TYPO3-spezifischen EXT:-Notation definiert. Ein Link muss mit `http://` oder `https://` beginnen. Wenn der Server durch ein Passwort geschützt ist, dann sind Usernamen und Passwort in analoger Form wie im folgenden Beispiel zu hinterlegen: `MeinUsername:MeinPasswort:http://mein-link.de/MeinePeriodList.yaml`. (Bei einem Link zu einer Yaml-Datei funktioniert der Yaml-Import-Befehl nicht.)

# flexform.timer.periodListTimer.field.yamlPeriodFalRelation.label
source: files with lists of dates in yaml format (FAL)
de: Dateien mit der Listen der Termine im YAML-Format (FAL)

# flexform.timer.periodListTimer.field.yamlPeriodFalRelation.description
source: The Yaml files can be uploaded to the TYPO3 backend in the regular way and linked here. If several files are uploaded, the lists are combined. There is no (!!!) check for overlapping or duplication of appointments.
de: Die Yaml-Dateien können ganz regulärer Weise im TYPO3-Backend hochgeladen werden und hier verlinkt werden. Werden mehrere Dateien hochgeladen, so werden die Listen zusammengefasst. Eine Kontrolle auf Überschneidungen oder Doppelungen bei den Terminen findet nicht(!!!) statt.

# flexform.timer.periodListTimer.field.yamlPeriodFalRelation.bottomAdd
source: add yaml-file
de: Lade YAML-Datei

# flexform.timer.periodListTimer.field.calendarJsFilePath.label
source: javascript path to calendar-framework
de: Javascript-Pfad zum Kalender-Framework

# flexform.timer.periodListTimer.field.calendarJsFilePath.description
source: Path to the javascript framework that can be used to display a list of dates in the form of a calendar (optional)
de: Pfad zum Javascript-Framework, mit dem eine Datumsliste in Form eines Kalenders dargestellt werden kann (optional)

# flexform.timer.periodListTimer.field.customCalendarJsFilePath
source: Path to the custom javascript that can be used to display a list of dates in the form of a calendar (optional)
de: Pfad zum benutzerdefinierten Javascript, mit dem eine Datumsliste in Form eines Kalenders dargestellt werden kann (optional)

# flexform.timer.periodListTimer.field.calendarCssFilePath.label
source: Path to CSS of the calendar-framework
de: Pfad zum CSS/Stylesheets des Kalenderdarstellung-Framework

# flexform.timer.periodListTimer.field.calendarCssFilePath.description
source: Many JavaScript frameworks for the calendar display of appointment lists come with their own CSS file, which can be integrated here by specifying the path - if necessary also in the `EXT:` notation.
de: Viele JavaScript-Frameworks zur Kalender-Darstellung von Terminlisten bringen eine eigene CSS-Datei mit, die gegebenenfalls hier über die Angabe des Pfade - ggfls auch in der `EXT:`-Notation - eingebunden werden kann.

# flexform.timer.periodListTimer.field.customCalendarCssFilePath
source: Path to the css-file with additional customized stylesheets
de: Pfad zur CSS-Datei mit zusätzlichen benutzerdefinierten Stylesheets

# flexform.timer.txTimerPeriodList.sheet.title
source: list of single timegaps from Yaml-files (not working yet)
de: Liste mit Einzelbereichen aus Yaml-Dateien (not working yet)

# flexform.timer.txTimerPeriodList.sheet.shortDescr
source: A list of dates in a yaml file is used as a setlist for displaying the content item.
de: Eine Liste mit Terminen in einer yaml-Datei wird als Setliste für die Anzeige des Inhaltselements genutzt.

# flexform.timer.txTimerPeriodList.sheet.description
source: Example: In a file [yamlPeriodFilePath] in YAML format, the list of active time periods is defined by defining a start time, an end time, a title and the time zone. In order to output the list in calendar format, you can use the Java script framework [calendarJsFilePath] and the associated style sheets [calendarCssFilePath] to be defined in the content element `periodList` and add your own JavaScript [customCalendarJsFilePath] and style sheets [customCalendarCssFilePath].
de: Beispiel: In einer Datei [yamlPeriodFilePath] im YAML-Format wird die Liste der aktiven Zeitbereiche definiert, indem man eine Startzeit, eine Endzeit, einen Titem und die Zeitzone definiert. Um die Liste im Kalenderformat auszugeben, kann man im Content-Element `periodList` das zu definierende Javaskript-Framework [calendarJsFilePath] und die dazugehörigen Stylesheets [calendarCssFilePath] nutzen und mit eigenen JavaScript [customCalendarJsFilePath] und Stylesheets [customCalendarCssFilePath] ergänzen.

# flexform.timer.rangeListTimer.field.recursiveLoopLimit
source: Max Count of recursion for determination of the overlappings of the ranges
de: Maximale Anzahl von Recursionen bei Bestimmung der Überschneidungen

# flexform.timer.rangeListTimer.field.yamlPeriodFilePath
source: yaml-file with list of active periods
de: yaml-Datei mit Liste der aktiven Perioden

# flexform.timer.rangeListTimer.field.yamlTextField.placeholder
source: # example YAML-structure (remove #) #periodList: # - # title: 'winter holidays Bremen' # configuration: # description: '- free to fill -' # start: '2022-01-31 00:00:00' # stop: '2022-02-01 23:59:59' # zone: 'Europe/Berlin'
de: # Beispiel YAML-Struktur (entferne #) #periodList: # - # title: 'Winterferien Bremen' # configuration: # description: '- für freie Texteingabe nutzbar -' # start: '2022-01-31 00:00:00' # stop: '2022-02-01 23:59:59' # zone: 'Europe/Berlin'

# flexform.timer.txTimerRangeList.sheet.title
source: rangelist from yaml-definitions
de: Bereichslisten aus Yaml-Definitionen

# flexform.timer.txTimerRangeList.sheet.shortDescr
source: Match a list of active timer definitions with forbidden timer definitions such as holidays. The timer lists can each be defined in a yaml file and/or in a database table.
de: Verrechne eine Liste mit aktiven Timer-Definitionen mit verbotenen Timer-Definitionen wie zum Beispiel Feiertagen. Die Timerlisten können jeweils in einer Yaml-Datei und/oder in einer Datenbanktabelle definiert werden.
