Repository: porthd/timer
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# content.timersimul.prolog.title.default
source: Test for Timer
de: Test für Timer

# content.timersimul.prolog.bodytext.default
source: This extension show some examples. It shows a simple examples how to use the extension. You can see the viewhelper in action. I hope, that the format.date will soon avaiable in the TYPO3-core.
de: Diese Erweiterung zeigt einige Beispiele. Es zeigt ein einfaches Beispiel zur Verwendung der Erweiterung. Sie können den Viewhelper in Aktion sehen. Ich hoffe, dass das format.date bald im TYPO3-Kern verfügbar sein wird.

# content.timersimul.events.title.default
source: Showcase Eventlist as test for the RangeListQueryDataprocessor
de: Showcase-Eventliste zum Test vom RangeListQueryDataprocessor

# content.timersimul.viewhelper.main.default
source: The extension includes three view helpers to optimize templating with Fluid and the Timer extension. The first view helper is >timer:flex<. TYPO3 has included the flex field since version 9.5. The Viewhelper allows converting a flexform string into a simple array, flattening superfluous levels in the array structure. The second view helper is >timer:isActive<. With this view helper you can check in the template whether data records provided with timer information should be displayed or not. Such an approach is inefficient in most cases. It is therefore recommended that you use the scheduler to generate the correct start and stop times for your element. In this way, unnecessary ballast can be kept away from the rendering of the frontend even when generating the data sets in a cacheable manner. The third view helper is >timer:format.date<. It extends the TYPO3 Fluid Viewhelper >f:format.date< with the `timezone` attribute, thus allowing the output of date displays for other than the default timezone.
de: Die Erweiterung enthält drei Viewhelper, um das Templating mit Fluid und der Timer-Extension zu optimieren. Der erste Viewhelper ist >timer:flex<. TYPO3 enthält seit Version 9.5 das Flex-Feld. Der Viewhelper erlaubt einen Flexformstring in einen einfachen Array umzuwandeln, wobei überflüssige Ebenen in der Array-Struktur eingeebnet werden können. Der zweite Viewhelper ist >timer:isActive<. Mit diesem Viewhelper können sie im Template prüfen, ob mit Timer-Informationen versehene Datensätze angezeigt werden sollen oder nicht. Ein solche Vorgehen ist in den meisten Fällen ineffizient. Es wird deshalb empfohlen, dass Sie den Planer verwenden, um die korrekten Start- und Stoppzeiten für Ihr Element zu generieren. So kann schon bei der cachebaren Generierung der Datensätze unnötiger Ballast vom Rendering des Frontends ferngehalten werden. Der dritte Viewhelper ist >timer:format.date<. Er erweitert den TYPO3-Fluid-Viewhelper >f:format.date< mit dem Attribut `timezone`, um so die Ausgabe von Datumsanzeigen für Andere als die Default-Zeitzone zu erlauben.

# content.timersimul.viewhelper.subtitle.flex
source: Viewhelper <timer:flex> for content of flex-fields
de: Anzeigehilfe <timer:flex> für den Inhalt von Flex-Feldern

# content.timersimul.viewhelper.prolog.flex
source: Usage is easy. The flexform string is passed to the view helper as input. This converts the flexform into an associative array and removes the named superfluous levels in this array. Avoid using the same names for fields in Flexforms. In this case, only the value of the field with the same name that appeared last in the array is output.
de: Die Verwendung ist einfach. Der Flexformstring wird als Input dem Viewhelper übergeben. Dieser wandelt die Flexform in einen assoziative Array um und entfernt die benannten überflüssigen Ebenen in diesem Array. Man vermeide gleiche Namen für Felder in Flexforms. In diesem Fall wird nur der Wert des zuletzt im Array auftauchende gleichbenannten Feldes ausgegeben.

# content.timersimul.viewhelper.header.flex.value
source: value
de: Wert

# content.perioditem.dataprocessed.header.flex.value
source: value
de: Wert

# content.timersimul.viewhelper.prolog.isActive
source: The view helper <timer:isActive> can be used for the individual selection of data records, if the better way via the scheduler task should not or cannot be chosen for some reason. In the following example, the current date value is used to determine whether the `timersimul` plugin is active or not.For testing and understanding purposes, it is useful if you set the timer for the plugin used here, for example with `txTimerDatePeriod`, so that all even hours are active.
de: Der Viewhelper <timer:isActive> kann zur individuellen Selektion von Datensätzen verwendet werden, wenn der bessere Weg über den Scheduler-Task aus irgendwelchen Gründen nicht gewählt werden soll oder kann. Im folgenden Beispiel wird der aktuelle Datumswert zugrundegelegt, um zu bestimmen, ob das plugin `timersimul` aktiv ist oder nicht.Für Test- und Verständniszwecke ist es günstig, wenn sie den Timer für das vorliegend genutzte Plugin zum Beispiel mit `txTimerDatePeriod` so einstellen, dass alle geraden Stunden als aktiv gelten.

# content.timersimul.viewhelper.postprolog.isActive
source: The view helper <timer:isActive> can be used for the individual selection of data records, if the better way via the scheduler task should not or cannot be chosen for some reason. In the following example, the current date value is used to determine whether the `timersimul` plugin is active or not.For testing and understanding purposes, it is useful if you set the timer for the plugin used here, for example with `txTimerDatePeriod`, so that all even hours are active.
de: Der Viewhelper <timer:isActive> kann auch genutzt werden, um für fremde Zeitzonen festzustellen, ob eine bestimmte Zeit auch gültig ist.

# content.timersimul.viewhelper.prologresult.isActive.active
source: An active state has just been reached here.
de: Hier wurde gerade ein aktiver Zustand erreicht.

# content.timersimul.viewhelper.subtitle.formatCalendarDate
source: Generalized date view helper for various PHP supported calendars
de: Generalisierter Datums-Viewhelper für verschiedene, vom PHP unterstützte Kalender

# content.timersimul.viewhelper.prolog.formatDate
source: The viewhelper <timer:format.date> is similiar to the TYPO3-Viehelper <f:format.date>. The onlydifference is the addional attribute `timezone`. You can define the output of time for a define timezone with it.
de: Der Viewhelper <timer:format.date> ist fast identisch mit dem TYPO3-Viehelper <f:format.date> und kennt das zusätzliche Attribut `timezone`. Dies erlaubt die Formatierung der Zeit-Datumsausgabe für eine definierte Zeitzone.

# content.timersimul.viewhelper.prologresult.isActive.inactive
source: An inactive state has just been reached here.
de: Hier wurde gerade ein inaktiver Zustand erreicht.

# content.timer.periodMessage.undefined.2
source: The periodic-parameters are defined `%s` the datetime of the event `%s`.
de: Die Periodic-Parameter sind definiert als `%s` die Datumszeit des Ereignisses `%s`.

# content.timer.periodMessage.general.undefined.1
source: The periodic-parameters are shown in the JSON-Format: `%s`.
de: Die periodischen Parameter werden im JSON-Format angezeigt: `%s`.

# content.timer.periodMessage.general.weekday.mo
source: Monday
de: Montag

# content.timer.periodMessage.general.weekday.tu
source: Tuesday
de: Dienstag

# content.timer.periodMessage.general.weekday.we
source: Wednesday
de: Mittwoch

# content.timer.periodMessage.general.weekday.th
source: Thursday
de: Donnerstag

# content.timer.periodMessage.general.weekday.fr
source: Friday
de: Freitag

# content.timer.periodMessage.general.weekday.sa
source: Saturday
de: Samstag

# content.timer.periodMessage.general.weekday.su
source: Sunday
de: Sonntag

# content.timer.periodMessage.general.beginEnd.default
source: The period begins and ends in the respective standard year.
de: Die Periode beginnt und endet im jeweiligen Standardjahr.

# content.timer.periodMessage.general.beginEnd.stop.1
source: The period starts in the default year and ends no later than `%s`.
de: Die Periode beginnt im Standardjahr und endet spätestens am `%s`.

# content.timer.periodMessage.general.beginEnd.start.1
source: The period starts at the earliest on `%s` and ends in the default year.
de: Die Periode beginnt frühestens am `%s` und endet im Standardjahr.

# content.timer.periodMessage.general.beginEnd.2
source: The period starts on `%s` at the earliest and ends on `%s` at the latest.
de: Die Periode beginnt frühestens am `%s` und endet spätestens am `%s`.

# content.timer.periodMessage.general.timeparts.min.many.1
source: %s minutes
de: %s Minuten

# content.timer.periodMessage.general.timeparts.hour.many.1
source: %s hours
de: %s Stunden

# content.timer.periodMessage.general.timeparts.day.many.1
source: %s days
de: %s Tage

# content.timer.periodMessage.general.timeparts.week.many.1
source: %s weeks
de: %s Wochen

# content.timer.periodMessage.general.timeparts.hour.single
source: 1 hour
de: 1 Stunde

# content.timer.periodMessage.general.timeparts.day.single
source: 1 day
de: 1 Tag

# content.timer.periodMessage.general.timeparts.week.single
source: 1 week
de: 1 Woche

# content.timer.periodMessage.general.timeparts.combine.2
source: %s and %s
de: %s und %s

# content.timer.periodMessage.general.timeparts.zero
source: 0 minute
de: 0 Minuten

# content.timer.periodMessage.datePeriod.period.zero
source: It never repeats itself.
de: Es wiederholt sich nie.

# content.timer.periodMessage.datePeriod.period.tm.one
source: It repeats every minute.
de: Es wiederholt sich jede Minute.

# content.timer.periodMessage.datePeriod.period.th.one
source: It repeats every hour.
de: Es wiederholt sich jede Stunde.

# content.timer.periodMessage.datePeriod.period.dd.one
source: It repeats itself every day.
de: Es wiederholt sich jeden Tag.

# content.timer.periodMessage.datePeriod.period.dw.one
source: It repeats itself every week.
de: Es wiederholt sich jede Woche.

# content.timer.periodMessage.datePeriod.period.dm.one
source: It repeats itself every month.
de: Es wiederholt sich jeden Monat.

# content.timer.periodMessage.datePeriod.period.dy.one
source: It repeats itself every year.
de: Es wiederholt sich jedes Jahr.

# content.timer.periodMessage.datePeriod.period.tm.many.1
source: It repeats every %s minutes.
de: Es wiederholt sich alle %s Minuten.

# content.timer.periodMessage.datePeriod.period.th.many.1
source: It repeats every %s hours.
de: Es wiederholt sich alle %s Stunden.

# content.timer.periodMessage.datePeriod.period.dd.many.1
source: It repeats every %s days.
de: Es wiederholt sich alle %s Tage.

# content.timer.periodMessage.datePeriod.period.dw.many.1
source: It repeats every %s weeks.
de: Es wiederholt sich alle %s Wochen.

# content.timer.periodMessage.datePeriod.period.dm.many.1
source: It repeats every %s months.
de: Es wiederholt sich alle %s Monate.

# content.timer.periodMessage.datePeriod.period.dy.many.1
source: It repeats every %s years.
de: Es wiederholt sich alle %s Jahre.

# content.timer.periodMessage.easterRelTimer.calendarUse.0
source: julianisch bi for < 1753; gregorian otherwise)
de: Kalender julianisch bis 1753

# content.timer.periodMessage.easterRelTimer.calendarUse.1
source: cal_easter_roman (julian for < 1583; gregorian otherwise)
de: Kalender julianisch bis 1583

# content.timer.periodMessage.easterRelTimer.calendarUse.2
source: cal_easter_always_gregorian (proleptic gregorian for ever)
de: gregorianischer Kalender

# content.timer.periodMessage.easterRelTimer.calendarUse.3
source: cal_easter_always_julian (proleptic gregorian for ever)
de: julianischer Kanlender

# content.timer.periodMessage.easterRelTimer.namedDate.0
source: easter
de: Ostersonntag

# content.timer.periodMessage.easterRelTimer.namedDate.1
source: ascension of Christ
de: Christi Himmelfahrt

# content.timer.periodMessage.easterRelTimer.namedDate.2
source: pentecost
de: Pfingsten

# content.timer.periodMessage.easterRelTimer.namedDate.3
source: first advent
de: 1. Advent

# content.timer.periodMessage.easterRelTimer.namedDate.4
source: christmas
de: 1. Weihnachtstag

# content.timer.periodMessage.easterRelTimer.namedDate.5
source: rose monday
de: Rosenmontag

# content.timer.periodMessage.easterRelTimer.namedDate.6
source: good friday
de: Karfreitag

# content.timer.periodMessage.easterRelTimer.description.zero.plus.3
source: The active time starts on %s (%s) and lasts %s.
de: Die aktive Zeit startet am %s (%s) und dauert %s.

# content.timer.periodMessage.easterRelTimer.description.zero.minus.3
source: The active time ends on %s (%s) and lasted %s.
de: Die aktive Zeit endet am %s (%s) und hat %s gedauert.

# content.timer.periodMessage.easterRelTimer.description.after.plus.4
source: The active time starts %s after the %s (%s) and lasts %s.
de: Die aktive Zeit startet %s nach dem %s (%s) und dauert %s.

# content.timer.periodMessage.easterRelTimer.description.after.minus.4
source: The active time starts %s before %s (%s) and lasts %s.
de: Die aktive Zeit startet %s vor dem %s (%s) und dauert %s.

# content.timer.periodMessage.easterRelTimer.description.before.plus.4
source: The active time ends %s after the %s (%s) and lasted %s.
de: Die aktive Zeit endet %s nach dem %s (%s) und hat %s gedauert.

# content.timer.periodMessage.easterRelTimer.description.before.minus.4
source: Active time ends %s before %s (%s) and lasted %s.
de: Die aktive Zeit endet %s vor dem %s (%s) und hat %s gedauert.

# content.timersimul.viewhelper.formatJewishDate.aspect.unixtimestamp
source: (All subsequent dates, converted to the Jewish calendar, refer to the selected Unix timestamp `1600000000s`. The time specification in the past means the seconds that have passed since January 1st, 1970. On average, one billion seconds corresponds to almost 31.7 years.)
de: (Alle nachfolgenden Datumsangaben, umgerechnet auf den jüdischen Kalender, beziehen sich auf den gewählten Unix-Timestamp `1600000000s`. Die in der Vergangenheit liegende Zeitangabe meint die Sekunden, die seit dem 1.1.1970 vergangen sind. Eine Milliarde Sekunden entsprechen im Mittel knapp 31,7 Jahren.)

# content.timersimul.viewhelper.formatCalendarDate.aspect.unixtimestamp
source: (All subsequent dates, converted to the various calendars, refer to the selected Unix timestamp `1600000000s`. The time specification in the past means the seconds that have passed since January 1st, 1970. On average, one billion seconds corresponds to almost 31 ,7 years. In the first sub-block, the various formatting variants are tested as examples. The inline variant is tested, which generates the foreign date in the fixed format in the second sub-block, in order to do this with the three formatting variants ICU, PHP-dateTime and PHP-strftime to generate an identical date as above. The last sub-block converts the foreign date into the Persian calendar to show that you can convert between the calendars at will. Only the Chinese calendar is problematic, probably because of a bug in PHP.)
de: (Alle nachfolgenden Datumsangaben, umgerechnet auf die verschiedenen Kalender, beziehen sich auf den gewählten Unix-Timestamp `1600000000s`. Die in der Vergangenheit liegende Zeitangabe meint die Sekunden, die seit dem 1.1.1970 vergangen sind. Eine Milliarde Sekunden entsprechen im Mittel knapp 31,7 Jahren. Im ersten Teilblock werden die verschiedenen Formatierungsvarianten exemplarisch erprobt. Auf wird die Inline-Variante erprobt, die im zweiten Teilblock das fremde Datum im fixierten Format generiert, um so mit den drei Formatierungsvarianten ICU, PHP-dateTime und PHP-strftime das identische Datum wie oben zu erzeugen. der letzte Teilblock konvertiert das fremde Datum in den persischen Kalender, um so zu zeigen, dass man zwischen den Kalender beliebig konvertieren kann. Problematisch ist nur der chinesische Kalender, vermutlich wegen eines Bugs im PHP.)

# content.timersimul.viewhelper.formatCalendarDate.aspect.current
source: (All subsequent dates, converted to the various calendars, refer to the current system date.)
de: (Alle nachfolgenden Datumsangaben, umgerechnet auf die verschiedenen Kalender, beziehen sich auf das aktuelle Systemdatum.)

# content.timersimul.viewhelper.formatJewishDate.aspect.format.strftime
source: (In contrast to the TYPO3 view helper `f:format.date`, this view helper `timer:format.jewishDate` does not support the format parameters of the php function `strftime`.)
de: (Im Gegensatz zum TYPO3-Viewhelper `f:format.date` werden von diesem Viewhelper `timer:format.jewishDate` die Format-Parameter der php-Funktion `strftime` nicht unterstützt.)

# calendarDateViewHelper.php.error
source: The poorly documented calendar function IntlDateFormater in PHP seems to have a bug when converting Chinese dates to Gregorian dates. As long as the bug is not fixed, no result for the conversion from the Chinese date to the Gregorian date will be output here. If the bug has been fixed in future PHP versions, this will be taken into account accordingly.
de: Die schlecht-dokumentierte Kalenderfunktion IntlDateFormater in PHP scheint einen Bug bei der Umrechnung des chinesischen Datums in das gregorianische Datum zu haben. Solange der Bug nicht gefixt ist, wird hier kein Ergebnis für die Umreechnung vom chinesischen Datum zum Gregorianischen Datum ausgegeben. Falls in zukünftigen PHP-Versionen der Bug gefixt wurde, wird dies entsprechend mit berücksichtigt.
