Repository: porthd/timer
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: de

# command.scheduler.title.timer.updater
source: Update starttime and endtime in various tables
de: Startzeit und Endzeit in verschiedenen Tabellen aktualisieren

# tx_timer_general.tab.timer
source: Select the timer-modell
de: Wählen Sie das Timer-Modell aus

# tx_timer_general.field.tx_timer_scheduler
source: allow to modify the start- and endtime of this element with the scheduler by a command-line-task (CLI)
de: erlauben, die Start- und Endzeit dieses Elements mit dem Planer über eine Befehlszeilenaufgabe (CLI) zu ändern

# tx_timer_general.field.tx_timer_timer
source: flexform-parameter for selected timer of active periods
de: Flexform-Parameter für ausgewählten Timer aktiver Perioden

# tx_timer_general.field.tx_timer_selector
source: Select the timer-model
de: Wählen Sie das Timer-Modell aus

# tx_timer_domain_model_event.model.title
source: Simple event-model
de: Einfaches Event-Modell

# tx_timer_domain_model_event.tab.single
source: Event
de: Vorfall

# tx_timer_domain_model_event.palette.timerlang
source: Lanuage-parts
de: Sprachteile

# tx_timer_domain_model_event.palette.timerteaserlink
source: Aspects
de: Aspekte

# tx_timer_domain_model_event.field.title
source: Title
de: Titel

# tx_timer_domain_model_event.field.description
source: Informations
de: Informationen

# tx_timer_domain_model_event.field.teaser_infotext
source: Shortinfos
de: Kurzinfos

# tx_timer_domain_model_event.field.flag_test
source: For tests only
de: Nur für Tests

# tx_timer_domain_model_listing.model.title
source: Simple listing-model
de: Einfaches Listing-Modell

# tx_timer_domain_model_listing.tab.single
source: listing times
de: Auflistungszeiten

# tx_timer_domain_model_listing.palette.timerlang
source: Lanuage-parts
de: Sprachteile

# tx_timer_domain_model_listing.palette.timerteaserlink
source: Aspects
de: Aspekte

# tx_timer_domain_model_listing.field.title
source: Title
de: Titel

# tx_timer_domain_model_listing.field.description
source: Informations
de: Informationen

# backend.contentElement.event.title
source: Timer for simple events
de: Timer für einfache Ereignisse

# extension.configuration.template.flag.useTestContent
source: Flag for TestContent: Only if the value is 1,true or TRUE, you can activate the predefined content-elements of this extension for your tests.
de: Flag for TestContent: Nur wenn der Wert 1,true oder TRUE ist, können Sie die vordefinierten Content-Elemente dieser Erweiterung für Ihre Tests aktivieren.

# extension.configuration.template.flag.flagPreviewTimerFrontend
source: Show preview-mark everytime on the page (inclusive a dat-time-form for temporäry previews).
de: Vorschau-Markierung immer auf der Seite anzeigen (inklusive Datum-Uhrzeit-Formular für temporäre Vorschauen).

# extension.configuration.template.flag.defaultBaseTimeZone
source: Default Timezone: Each timer-event is defined for its own timezone. You define her, which timezone will set on default by the typo3-backend. The default-value by blank or undefined zones is `UTC`.
de: Default Timezone: Jedes Timer-Event ist für seine eigene Zeitzone definiert. Sie legen hier fest, welche Zeitzone vom Typo3-Backend standardmäßig eingestellt wird. Der Default-Wert bei leeren oder undefinierten Zonen ist `UTC`.

# extension.configuration.template.flag.selectInternatTimer
source: Activate predefined Timer: Summarize the values to activate only the timer you really need. (all = 2047 // Daily = 1, DatePeriod = 2, Default[null] = 4, EasterRel =8, MoonphaseRel = 16, MoonriseRel = 32, PeriodList = 64, RangeList = 128, SunriseRel = 256, WeekdayInMonth = 512, Weekdayly = 1024)
de: Vordefinierten Timer aktivieren: Fassen Sie die Werte zusammen, um nur den wirklich benötigten Timer zu aktivieren. (all = 2047 // Daily = 1, DatePeriod = 2, Default[null] = 4, EasterRel =8, MoonphaseRel = 16, MoonriseRel = 32, PeriodList = 64, RangeList = 128, SunriseRel = 256, WeekdayInMonth = 512, Weekdayly = 1024)

# tx_timer_domain_model_timings.tca.type.customTimer.datePeriod.title
source: Periods after Date (i.e. Yearly)
de: Zeiträume nach dem Datum (z. B. jährlich)

# tx_timer_domain_model_timings.tca.type.customTimer.datePeriod.description
source: Remark an active delay-time after as special date repeating in flexible ways
de: Bemerken Sie eine aktive Verzögerungszeit danach als Sonderdatum, das sich flexibel wiederholen lässt

# tx_timer.tca.general.div.timerParams.lable
source: Periods
de: Perioden

# newContentElement.tx_timer_timersimul.const.pathesFor.libFLuidContent
source: key for pathes: number for template-, partial- and layout-pathes in the typoscript `lib.fluidContent`
de: Schlüssel für Pfade: Nummer für Template-, Partial- und Layout-Pfade im Typoscript `lib.fluidContent`

# newContentElement.tx_timer_timersimul.const.pathesFor.libContentElement
source: key for pathes: number for template-, partial- and layout-pathes in the typoscript `lib.contentElment`
de: Schlüssel für Pfade: Zahl für Template-, Partial- und Layout-Pfade im Typoscript `lib.contentElment`

# newContentElement.tx_timer_timersimul.pages.forList
source: list of page-id for pages, which contains events used by the example content-element `tx_timer_timersimul`
de: Schlüssel für Pfade: Zahl für Template-, Partial- und Layout-Pfade im Typoscript `lib.contentElment`

# backend.pageModul.timerTimersimul.info
source: This content-element is only for propose of testing and adding some example-code to the extension.
de: Dieses Inhaltselement dient nur zum Testen und Hinzufügen von Beispielcode zur Erweiterung.

# task.timer.updateTimesByTimer.title
source: Update start- and endtime by timer
de: Start- und Endzeit per Timer aktualisieren

# task.timer.updateTimesByTimer.help
source: <br /> The Commandcontroller will update the field starttime and endtime in a selected table, if the tx_timer_select-Field is not empty and the field `deleted`is zero. <br /> The yaml-file contains the list of table in the array ``. The subarray `where-equal` of a table contain additional field-value-pairs for the where-block of the query. <br /> The array `rootline` restricts the results to rows, which aree part of the branch with the listed pids in its root/branch. <br />
de: <br /> Der Commandcontroller aktualisiert die Felder starttime und endtime in einer selektierten Tabelle, wenn das tx_timer_select-Field nicht leer und das Feld `deleted`null ist. <br /> Die yaml-Datei enthält die Liste der Tabellen im Array ``. Das Subarray `where-equal` einer Tabelle enthält zusätzliche Feld-Wert-Paare für den Where-Block der Abfrage. <br /> Das Array `rootline` schränkt die Ergebnisse auf Zeilen ein, die Teil des Zweigs mit den aufgelisteten PIDs in seinem Stamm/Zweig sind. <br />

# task.timer.updateTimesByTimer.yamltablelist
source: The yaml-file contains the List of table, which should be updated, and the cache-commands Die yaml-Datei enthält die Liste der Tabellen, die aktualisiert werden sollen, und die Cache-Anweisungen
de: Die yaml-Datei enthält die Liste der Tabellen, die aktualisiert werden sollen, und die Cache-Anweisungen

# task.timer.exception.yamlNotExit.1
source: The parameter for the yaml-file does not exit. Check the path in your variable `%s`.
de: Der Parameter für die yaml-Datei wird nicht beendet. Überprüfen Sie den Pfad in Ihrer Variable `%s`.

# task.timer.warning.yamlNotAllUpdated.3
source: The parameter for the yaml-file does not exit. Check the path in your variable `%s`.
de: Der Parameter für die yaml-Datei wird nicht beendet. Überprüfen Sie den Pfad in Ihrer Variable `%s`.

source: Reset of publishingDate and Expiration Date
de: Zurücksetzen von Veröffentlichungsdatum und Ablaufdatum

source: The fields `starttime`(publishingDate) and `endtime`(Expiration Date) have been changed to zero.
de: Die Felder `starttime`(publishingDate) und `endtime`(expiration date) wurden auf Null geändert.

# timer.typoescript.constants.pathes.templates
source: Templtes:Path to template root (FE)
de: Vorlagen:Pfad zum Vorlagenstamm (FE)

# timer.typoescript.constants.pathes.partials
source: Partials:Path to template partials (FE)
de: Partials:Pfad zu Template-Partials (FE)

# timer.typoescript.constants.pathes.layout
source: Layout:Path to template layouts (FE)
de: Layout:Pfad zu Vorlagenlayouts (FE)
