Repository: porthd/timer
Catalog: Resources/Private/Language/locallang_cal.xlf
Languages: de

# calendarDate.christ.greg.testCutomTimerForTimer
source: my test for customtimer, which is defined by this extension
de: Mein Test für einen Nutzer-definierten Timer, der durch die Extension bereitgestellt wird

# calendarDate.christ.greg.christmasEve
source: christmas eve
de: Heiligabend

# calendarDate.christ.greg.christmasWeekend
source: Christmas or following Monday
de: Weihnachten oder nachfolgender Montag

# calendarDate.christ.greg.boxingdayWeekend
source: Christmas (2nd day) or following Monday
de: Weihnachten (2. Tag) oder nachfolgender Montag

# calendarDate.christ.greg.christmas
source: Christmas
de: Weihnachten

# calendarDate.christ.greg.christmasSecondDay
source: Christmas (Day 2)
de: Weihnachten (2. Tag)

# calendarDate.cult.greg.silvester
source: New Year's Eve
de: Silvester

# calendarDate.cult.greg.newyear
source: New Year or following Monday
de: Neujahr oder nachfolgender Montag

# calendarDate.cult.greg.newyear
source: New Year
de: Neujahr

# calendarDate.cult.greg.holyThreeKings
source: Holy Three Kings
de: Heilige drei Könige

# calendarDate.cult.greg.mariapregnant
source: Candlemas
de: Mariä Lichtmeß

# calendarDate.eco.greg.valentinsday
source: valentines day
de: Valentinstag

# calendarDate.eco.greg.WomensShrovetide
source: Women's Shrovetide
de: Weiberfastnacht

# calendarDate.christ.greg.rosemonday
source: Shrove Monday
de: Rosenmontag

# calendarDate.christ.greg.carnival
source: carnival
de: Fasching

# calendarDate.christ.greg.worldwomenday
source: International Women's Day
de: Weltfrauentag

# calendarDate.christ.greg.greenthursday
source: Green Thursday
de: Grüner Donnerstag

# calendarDate.christ.greg.goodfriday
source: Good Friday
de: Karfreitag

# calendarDate.christ.greg.easter
source: Easter
de: Ostern

# calendarDate.christ.greg.eastermonday
source: easter monday
de: Ostermontag

# calendarDate.christ.greg.orthoEaster
source: Easter
de: Ostern

# calendarDate.christ.greg.orthoEasterMonday
source: easter monday
de: Ostermontag

# calendarDate.hist.greg.stupidity
source: World Stupid Day
de: Welttag der Dummheit

# calendarDate.hist.greg.walpurgis
source: Walpurgis Night
de: Walpurgisnacht

# calendarDate.hist.greg.labourday
source: Labor Day
de: Tag der Arbeit

# calendarDate.hist.greg.freeByAllierts
source: à l'occasion de la fête de la liberation allée
de: à l'occasion de la fête de la libération alliée

# calendarDate.hist.greg.mothersday
source: Mother's Day
de: Muttertag

# calendarDate.hist.greg.towlday
source: World Towel Day
de: Welthandtuchtag

# calendarDate.hist.greg.ascension
source: Ascension Day
de: Christi Himmerlfahrt

# calendarDate.christ.greg.pentecost
source: Pentecost
de: Pfingsten

# calendarDate.christ.greg.pentecostmonday
source: White Monday
de: Pfingstmontag

# calendarDate.christ.julian.orthoPentecost
source: Pentecost (orthodox)
de: Pfingsten (orthodox)

# calendarDate.christ.julian.orthoPentecostMonday
source: White Monday (orthodox)
de: Pfingstmontag (orthodox)

# calendarDate.christ.greg.happycadaver
source: Corpus Christi
de: Fronleichnam

# calendarDate.christ.greg.revolte17june
source: Uprising of June 17th
de: Aufstand des 17. Juni

# calendarDate.christ.greg.peterandpaul
source: peter and paul
de: Peter und Paul

# calendarDate.christ.greg.grandNationfrance
source: National Day France
de: Nationalfeiertag Frankreich

# calendarDate.christ.greg.augsburgepeacefete
source: Augsburg Peace Festival
de: Augsburger Friedensfest

# calendarDate.hist.greg.mariaascension
source: Assumption Day
de: Maria Himmelfahrt

# calendarDate.hist.greg.worldchildrenday
source: World Children's Day
de: Welt Kindertag

# calendarDate.hist.greg.germanunity
source: Day of German unity
de: Tag der Deutschen Einheit

# calendarDate.hist.greg.haloween
source: Halloween
de: Haloween

# calendarDate.hist.greg.reformationDay
source: Reformation Day
de: Reformationstag

# calendarDate.hist.greg.allSaintsDay
source: all saints day
de: Allerheiligen

# calendarDate.hist.greg.fallOfTheWall
source: fall of the wall
de: Mauerfall

# calendarDate.hist.greg.armistice1918
source: armistice; on the occasion of the armistice of 1918
de: Armistice; anlässlich des Waffenstillstands 1918

# calendarDate.hist.greg.startcarneval
source: Beginning of the carnival season
de: Beginn der Karnevalszeit

# calendarDate.hist.greg.sanktAndrewDay
source: Saint Andrew Day
de: St Andrew Day

# calendarDate.cult.greg.dayOfPrayerAndRepentance
source: repentance and bed day
de: Buß und Betttag

# calendarDate.christ.greg.deadSunday
source: dead sunday
de: Totensonntag

# calendarDate.christ.greg.nobelprice
source: Nobel Prize Ceremony
de: Nobelpreisverleihung

# calendarDate.christ.greg.secondAdvent
source: 2nd Advent
de: 2. Advent

# calendarDate.christ.greg.thirdAdvent
source: 3rd Advent
de: 3. Advent

# calendarDate.christ.greg.forthAdvent
source: 4th Advent
de: 4. Advent

# calendarDate.cult.chin.newyear
source: Chinese New Year
de: Chin. Neujahr

# calendarDate.rel.isl.lailatAlBaraa
source: Laylat Al Baraat (Night of Forgiveness)
de: Laylat Al Baraat (Nacht der Vergebung)

# calendarDate.rel.isl.ramadan
source: Ramadan (beginning of Lent)
de: Ramadan (Beginn der Fastenzeit)

# calendarDate.rel.isl.laylatulQadr
source: Laylat al-Qadr (Night of Destiny)
de: Laylat al-Qadr (Nacht der Bestimmung)

# calendarDate.rel.isl.eidAlFitr
source: Eid al-Fitr (Day of Breaking the Fast)
de: Eid al-Fitr (Tag des Fastenbrechens)

# calendarDate.rel.isl.eidUlAdha
source: Eid ul-Adha (Feast of Sacrifice)
de: Eid ul-Adha (Opferfest)

# calendarDate.rel.isl.aschura
source: Ashura
de: Aschura

# calendarDate.rel.isl.newYear
source: Islamic New Year
de: Isl. Neujahr

# calendarDate.rel.isl.sunnit.MaulidAnNabi
source: Sunnis: Birthday of the Prophet (Maulid an-Nabī)
de: Sunniten: Geburtstag des Propheten (Maulid an-Nabī)

# calendarDate.rel.isl.schiit.MaulidAnNabi
source: Shias: Birthday of the Prophet (Maulid an-Nabī)
de: Schiiten: Geburtstag des Propheten (Maulid an-Nabī)

# calendarDate.cult.greg.ch.dayOfThanksPrayerAndRepentance
source: Federal Day of Thanksgiving, Repentance and Prayer
de: Eidgenössischer Dank-, Buss- und Bettag

# calendarDate.cult.greg.ch.genfPrayer
source: Geneva bed day
de: Genfer Betttag

# calendarDate.rel.hebr.roschHaschana
source: Jewish New Year (Rosh Hashanah)
de: Jüd. Neujahrsfest (Rosch Haschana)

# calendarDate.rel.hebr.roschHaschanaIi
source: Jewish Lunar New Year Day 2 (Rosh Hashanah II)
de: Jüd. Neujahrsfest 2. Tag (Rosch Haschana II)

# calendarDate.rel.hebr.jomKippur
source: Day of Atonement (Yom Kippur)
de: Versöhnungstag (Jom Kippur)

# calendarDate.rel.hebr.sukkot
source: Feast of Tabernacles (Sukkot)
de: Laubhüttenfest (Sukkot)

# calendarDate.rel.hebr.scheminiAzeret
source: Closing Festival (Shemini Atzeret)
de: Schlussfest (Schemini Azeret)

# calendarDate.rel.hebr.simchatTora
source: Torah joy festival (Simchat Torah)
de: Torafreudenfest (Simchat Tora)

# calendarDate.rel.hebr.chanukka
source: Temple dedication (Hanukkah)
de: Tempelweihfest (Chanukka)

# calendarDate.rel.hebr.tuBischwat
source: New Year Festival of Trees (Tu Bishvat)
de: Neujahrsfest der Bäume (Tu Bischwat)

# calendarDate.rel.hebr.purim
source: Salvation of the Jews in Persia (Purim)
de: Errettung der Juden in Persien (Purim)

# calendarDate.rel.hebr.pessach
source: Beginning of the 1st pilgrimage festival (Pessach / crossing)
de: Beginn des 1. Wallfahrtfestes (Pessach / Überschreitung)

# calendarDate.rel.hebr.firstSchawuot
source: 1st day of the Feast of Weeks (Shavuot)
de: 1. Tag des Wochenfests (Schawuot)

# calendarDate.rel.hebr.secondSchawuot
source: 2nd day of the Feast of Weeks (Shavuot)
de: 2. Tag des Wochenfests (Schawuot)

# calendarDate.rel.hebr.jomHaschoa
source: Memorial Day for the Victims of the Shoah (Yom Hashoah)
de: Gedenktag an die Opfer der Schoa (Jom Haschoa)

# calendarDate.rel.hebr.jomHaAzmaUt
source: Independence Day (Yom Ha'azma'ut)
de: Unabhängigkeitstag (Jom Ha’azma’ut)

# calendarDate.rel.hebr.jomJeruschalajim
source: Jerusalem Day (Yom Yerushalayim)
de: Jerusalemtag (Jom Jeruschalajim)

# calendarDate.cult.greg.jpNewYear
source: New Year (Japan)
de: Neujahr (Japan)

# calendarDate.cult.greg.cvDayOfDemocracy
source: Cape Verde: Democracy Day
de: Kap Verde: Tag der Demokratie

# calendarDate.cult.greg.jpDayOfAdults
source: adult day
de: Tag der Erwachsenen

# calendarDate.cult.greg.jpDayOfAdultsNew
source: adult day
de: Tag der Erwachsenen

# calendarDate.cult.greg.cvDayOfHeros
source: Cape Verde: National Heroes Day
de: Kap Verde: Nationaler Heldentag

# calendarDate.cult.greg.jpStateFoundation
source: Japan Founding Day
de: Japan Tag der Staatsgründung

# calendarDate.cult.greg.jpTennoBirthday
source: Japan Emperor's Birthday
de: Japan Geburtstag des Kaisers

# calendarDate.cult.greg.spring
source: beginning of spring
de: Frühlingsanfang

# calendarDate.cult.greg.crJuanSantaMaria
source: Costa Rica: Juan Santamaria Day
de: Costa Rica: Juan Santamaría Day

# calendarDate.cult.greg.jpDayOfShowa
source: Day of the Showa era
de: Tag der Showa-Ära

# calendarDate.cult.greg.jpDayOfGroundLaw
source: Japan: Constitution Day
de: Japan: Tag derVerfassung

# calendarDate.cult.greg.jpDayOfGreenings
source: Japan: Green Day
de: Japan: Tag des Grüns

# calendarDate.cult.greg.jpDayOfChildren
source: Japan: Children's Day
de: Japan: Tag der Kinder

# calendarDate.cult.greg.cvDayOfChildren
source: Cape Verde: Children's Day
de: Kap Verde: Kindertag

# calendarDate.cult.greg.cvDayOfIndependency
source: Cape Verde: Independence Day
de: Kap Verde: Unabhängigkeitstag

# calendarDate.cult.greg.jpDayOfOcean
source: Japan: Sea Day
de: Japan: Tag des Meeres

# calendarDate.cult.greg.jpDayOfSport
source: Japan: Sports Day
de: Japan: Tag des Sports

# calendarDate.cult.greg.crAnexionDelPartidoDeNicoyaGuanacaste
source: Annex del Partido de Nicoya / Guanacaste
de: Anexión del Partido de Nicoya / Guanacaste

# calendarDate.cult.greg.crVirgenDeLosÁngeles
source: Day of the Virgin of the Angels
de: Tag der Jungfrau der Engel

# calendarDate.cult.greg.jpDayOfMountain
source: Japan: Mountain Day
de: Japan: Tag des Berges

# calendarDate.cult.greg.crDiaMadre
source: Costa Rica: Mother's Day/Día de la Madre
de: Costa Rica: Muttertag/Día de la Madre

# calendarDate.cult.greg.crDiaPersonaNegra
source: Dia de la Persona Negra
de: Día de la Persona Negra

# calendarDate.cult.greg.crDiaIndependencia
source: Catsa Rica's Independence Day
de: Catsa Ricas Unabhängigkeitstag

# calendarDate.cult.greg.autumn
source: beginning of autumn
de: Herbstsanfang

# calendarDate.cult.greg.jpDayOfCulture
source: Japan: Culture Day
de: Japan: Tag der Kultur

# calendarDate.cult.greg.jpDayOfThanksForLabour
source: Japan: Labor Thanksgiving Day
de: Japan: Tag des Dankes für die Arbeit

# calendarDate.cult.greg.crDiaAbolicionEjercito
source: Army Abolition Day (Costa Rica)
de: Tag der Abschaffung der Armee (Costa Rica)

# calendarDate.cult.greg.muNewyearSecondDay
source: Mauritius: New Year Second Day
de: Mauritius: Neujahr Zweiter Tag

# calendarDate.hist.greg.liBertoldsDay
source: Bertolds day/second new year day
de: Bertoldstag/zweiter Neujahrstag

# calendarDate.cult.greg.mxConstituationLayOfMexico
source: Mexican Constitution Day
de: Tag der mexikanischen Verfassung

# calendarDate.cult.greg.muAbolitionOfSlavery
source: Mauritius: Abolition of Slavery
de: Mauritius: Abschaffung der Sklaverei

# calendarDate.cult.greg.mzHerosDay
source: Mozambique: Heroes' Day
de: Mosambik: Heldentag

# calendarDate.cult.greg.lrArmedForceDay
source: Liberia: Army Day
de: Liberia: Tag der Armee

# calendarDate.cult.greg.muNationalHoliday
source: Mauritius: National Day
de: Mauritius: Nationalfeiertag

# calendarDate.cult.greg.lrDecorationDay
source: Liberia: Days of Embellishment
de: Liberia: Tage der Ausschmückung

# calendarDate.cult.greg.lrJJRobertsBirthday
source: Liberia: J.J. Roberts' birthday
de: Liberia: J. J. Roberts’ Geburtstag

# calendarDate.hist.greg.liJosefi
source: joseph
de: Josefi

# calendarDate.cult.greg.mxBirthdayOfBenitoJuarez
source: Mexico: Birthday of Benito Juárez
de: Mexico: Geburtstag von Benito Juárez

# calendarDate.cult.greg.lrFastPrayerDay
source: Liberia: Fasting and Prayer
de: Liberia: Fasten und Beten

# calendarDate.cult.greg.mtFreedomDay
source: Malta: Freedom Day
de: Malta: Freiheitstag

# calendarDate.cult.greg.mzWomenDay
source: Mozambique: Women's Day
de: Mosambik: Frauentag

# calendarDate.hist.greg.lvDayOfGroundlaw
source: Latvia: Convening of the Latvian Constitutional Committee, Labor Day
de: Lettland: Einberufung des lettischen Verfassungsausschusses, Tag der Arbeit

# calendarDate.hist.greg.lvDayOfNewIndependence
source: Latvia: Renewal of IndependenceConvening of Latvian Constitutional Committee, Labor Day
de: Lettland: Erneuerung der Unabhängigkeit / Einberufung des lettischen Verfassungsausschusses, Tag der Arbeit

# calendarDate.cult.greg.lrNationalUnificationDay
source: Liberia: National Unification Day
de: Liberia: Tag der nationalen Vereinigung

# calendarDate.cult.greg.hrNationHoliday
source: State holiday Croatia
de: Staatsfeiertag Kroatien

# calendarDate.cult.greg.hrDayOfAntifashismFights
source: Croatia: Day of Antifascist Struggle
de: Kroation:Tag des antifaschistischen Kampfes

# calendarDate.hist.greg.lvDayOfJohanni
source: Latvia: Midsummer Day
de: Lettland: Johannisfest

# calendarDate.hist.greg.lvJaeni
source: Latvia: Jan
de: Lettland: Jäni

# calendarDate.cult.greg.mzIndependenceDay
source: Mozambique: Independence Day
de: Mosambik: Unabhängigkeitstag

# calendarDate.cult.greg.lrIndependenceDay
source: Liberia: Independence Day
de: Liberia: Unabhängigkeitstag

# calendarDate.cult.greg.hrDayOfWinAndThanks
source: Croatia: Day of Victory and Homeland Gratitude
de: Kroation: Tag des Sieges und der heimatlichen Dankbarkeit

# calendarDate.hist.greg.liMariabirthday
source: Birth of Mary
de: Maria Geburt

# calendarDate.cult.greg.lrFlagDay
source: Liberia: Flag Day
de: Liberia: Flaggentag

# calendarDate.cult.greg.mzVictoryDay
source: Mozambique: Victory Day
de: Mosambik: Siegestag

# calendarDate.cult.greg.mtVictoriaDay
source: Malta: Victory Day
de: Malta: Siegestag

# calendarDate.hist.greg.mxDiaIndependencia
source: Mexico's Independence Day
de: Mexikos Unabhängigkeitstag

# calendarDate.cult.greg.mtIndependenceDay
source: Malta: Independence Day
de: Malta: Unabhängigkeitstag

# calendarDate.cult.greg.mzArmedForcesDay
source: Mozambique: Army Day
de: Mosambik: Tag der Armee

# calendarDate.cult.greg.mzPeaceAndReconciliationDay
source: Mozambique: Day of Peace and Reconciliation
de: Mosambik: Tag des Friedens und der Versöhnung

# calendarDate.hist.greg.muAllSaintsDay
source: Mauritius: All Saints' Day
de: Mauritius: Allerheiligen

# calendarDate.cult.greg.muArrivalOfIndenturedLabourers
source: Mauritius: Arrival of the Indian workers
de: Mauritius: Ankunft der indischen Arbeiter

# calendarDate.cult.greg.lrThanksGivingDay
source: Liberia: Thanksgiving Day
de: Liberia: Thanksgiving Day (Erntedankfest)

# calendarDate.cult.greg.hrDayOfVictimsOfHomewar
source: Croatia: Memorial Day for the victims of the Homeland War and Vukovar and Škabrnja
de: Kroation: Gedenktag für die Opfer des Heimatkrieges und von Vukovar und Škabrnja

# calendarDate.hist.greg.lvDateOfStateFoundation
source: Latvia: Proclamation of the Republic of Latvia 1918 (National Day)
de: Lettland: Proklamierung der Republik Lettland 1918 (Nationalfeiertag)

# calendarDate.hist.greg.mcNationHoliday
source: Monaco: National Day
de: Monaco: Nationalfeiertag

# calendarDate.cult.greg.mxNovemberRevolution
source: Commemorating the November 20th - Anniversary of the Mexican Revolution
de: Gedenken an den 20 November - Jahrestag der mexikanischen Revolution

# calendarDate.cult.greg.lrPresidentTubmansBirthday
source: Liberia: President Tubman's birthday
de: Liberia: Präsident Tubman’s Geburtstag

# calendarDate.hist.greg.sanktAndrewDay
source: Mexico: handover of power to the new president
de: Mexiko: Machtübergabe an den neuen Präsidenten

# calendarDate.hist.greg.liNikolaus
source: Nicholas
de: Nikolaus

# calendarDate.hist.greg.liMariaPregnancy
source: Conception
de: Mariä Empfangnis

# calendarDate.cult.greg.mtRepublicDay
source: Malta: Republic Day
de: Malta: Tag der Republic

# calendarDate.christ.greg.worldanticorruptionday
source: World Anti-Corruption Day
de: Weltantikorruptionstag

# calendarDate.cult.greg.earlyAugustBankholiday
source: early August bank holiday
de: Früher August-Bankfeiertag

# calendarDate.cult.greg.jpHonorForElderPeople
source: Day of Homage to Age
de: Tag der Ehrerbietung vor dem Alter

# calendarDate.cult.greg.jpNewYear
source: New Year
de: Neujahr

# calendarDate.cult.greg.nzPostNewYear
source: Post New Year
de: Post-Neujahr

# calendarDate.cult.greg.nzAnzacDay
source: Anzac Day (New Zealand)
de: Anzac Day (Neuseeland)

# calendarDate.cult.greg.nzKingsBirthday
source: King's Birthday (New Zealand)
de: Kings Birthday (Neuseeland)

# calendarDate.cult.greg.nzMatakiri
source: Matakiri (estimated, new moon after rising of the Pleiades; New Zealand)
de: Matakiri (geschätzt, Neumond nach Aufgang der Plejaden; Neuseeland)

# calendarDate.cult.greg.nzLabourDay
source: Labor Day(New Zealand)
de: Tag der Arbeit(Neuseeland)

# locale.icu.nation.alb
source: Albania
de: Albanien

# locale.icu.nation.dza
source: Algeria
de: Algerien

# locale.icu.nation.asm
source: American Samoa
de: Amerikanischen Samoa-Inseln

# locale.icu.nation.ata
source: Antarctica
de: Antarktis

# locale.icu.nation.atg
source: Antigua and Barbuda
de: Antigua und Barbuda

# locale.icu.nation.arg
source: Argentina
de: Argentinien

# locale.icu.nation.arm
source: Armenia
de: Armenien

# locale.icu.nation.aus
source: Australia
de: Australien

# locale.icu.nation.aut
source: Austria
de: Österreich

# locale.icu.nation.aze
source: Azerbaijan
de: Aserbaidschan

# locale.icu.nation.bhr
source: Bahrain
de: Bahrein

# locale.icu.nation.bgd
source: Bangladesh
de: Bangladesch

# locale.icu.nation.blr
source: Belarus
de: Weißrussland

# locale.icu.nation.bel
source: Belgium
de: Belgien

# locale.icu.nation.bmu
source: Bermuda
de: Bermudas

# locale.icu.nation.bol
source: Bolivia (Plurinational State of)
de: Bolivien (plurinationaler Staat)

# locale.icu.nation.bes
source: Bonaire, Sint Eustatius and Saba
de: Bonaire, Sint Eustatius und Saba

# locale.icu.nation.bih
source: Bosnia and Herzegovina
de: Bosnien und Herzegowina

# locale.icu.nation.bvt
source: Bouvet Island
de: Bouvet-Insel

# locale.icu.nation.bra
source: Brazil
de: Brasilien

# locale.icu.nation.iot
source: British Indian Ocean Territory
de: Britisches Territorium im Indischen Ozean (das)

# locale.icu.nation.bgr
source: Bulgaria
de: Bulgarien

# locale.icu.nation.khm
source: Cambodia
de: Kambodscha

# locale.icu.nation.cmr
source: Cameroon
de: Kamerun

# locale.icu.nation.can
source: Canada
de: Kanada

# locale.icu.nation.cym
source: Cayman Islands
de: Kaimaninseln

# locale.icu.nation.caf
source: Central African Republic
de: Zentralafrikanische Republik

# locale.icu.nation.tcd
source: Chad
de: Tschad

# locale.icu.nation.cxr
source: Christmas Island
de: Weihnachtsinsel

# locale.icu.nation.cck
source: Cocos (Keeling) Islands
de: Kokos-(Keeling-)Inseln

# locale.icu.nation.col
source: Colombia
de: Kolumbien

# locale.icu.nation.com
source: Comoros
de: Komoren (die)

# locale.icu.nation.cod
source: Congo (the Democratic Republic of the)
de: Kongo (die Demokratische Republik)

# locale.icu.nation.cog
source: Congo
de: Kongo

# locale.icu.nation.cok
source: Cook Islands
de: Cookinseln

# locale.icu.nation.hrv
source: Croatia
de: Kroatien

# locale.icu.nation.cub
source: Cuba
de: Kuba

# locale.icu.nation.cuw
source: Curaçao
de: Curacao

# locale.icu.nation.cyp
source: Cyprus
de: Zypern

# locale.icu.nation.cze
source: Czechia
de: Tschechien

# locale.icu.nation.civ
source: Côte d`Ivoire
de: Elfenbeinküste

# locale.icu.nation.dnk
source: Denmark
de: Dänemark

# locale.icu.nation.dji
source: Djibouti
de: Dschibuti

# locale.icu.nation.dma
source: Dominica
de: Dominika

# locale.icu.nation.dom
source: Dominican Republic
de: Dominikanische Republik

# locale.icu.nation.egy
source: Egypt
de: Ägypten

# locale.icu.nation.gnq
source: Equatorial Guinea
de: Äquatorialguinea

# locale.icu.nation.est
source: Estonia
de: Estland

# locale.icu.nation.eth
source: Ethiopia
de: Äthiopien

# locale.icu.nation.flk
source: Falkland Islands [Malvinas]
de: Falklandinseln [Malvinas]

# locale.icu.nation.fro
source: Faroe Islands
de: Färöer (die)

# locale.icu.nation.fji
source: Fiji
de: Fidschi

# locale.icu.nation.fin
source: Finland
de: Finnland

# locale.icu.nation.fra
source: France
de: Frankreich

# locale.icu.nation.guf
source: French Guiana
de: Französisch-Guayana

# locale.icu.nation.pyf
source: French Polynesia
de: Französisch Polynesien

# locale.icu.nation.atf
source: French Southern Territories
de: Französische Südgebiete

# locale.icu.nation.gab
source: Gabon
de: Gabun

# locale.icu.nation.gmb
source: Gambia
de: Gambia (das)

# locale.icu.nation.deu
source: Germany
de: Deutschland

# locale.icu.nation.grc
source: Greece
de: Griechenland

# locale.icu.nation.grl
source: Greenland
de: Grönland

# locale.icu.nation.hmd
source: Heard Island and McDonald Islands
de: Heard-Insel und McDonald-Inseln

# locale.icu.nation.vat
source: Holy See
de: Heiliger Stuhl

# locale.icu.nation.hun
source: Hungary
de: Ungarn

# locale.icu.nation.isl
source: Iceland
de: Island

# locale.icu.nation.ind
source: India
de: Indien

# locale.icu.nation.idn
source: Indonesia
de: Indonesien

# locale.icu.nation.irn
source: Iran (Islamic Republic of)
de: Iran (Islamische Republik)

# locale.icu.nation.irq
source: Iraq
de: Irak

# locale.icu.nation.irl
source: Ireland
de: Irland

# locale.icu.nation.ita
source: Italy
de: Italien

# locale.icu.nation.jam
source: Jamaica
de: Jamaika

# locale.icu.nation.jor
source: Jordan
de: Jordanien

# locale.icu.nation.kaz
source: Kazakhstan
de: Kasachstan

# locale.icu.nation.ken
source: Kenya
de: Kenia

# locale.icu.nation.prk
source: Korea (the Democratic People`s Republic of)
de: Korea (Demokratische Volksrepublik)

# locale.icu.nation.kor
source: Korea (the Republic of)
de: Korea (Republik)

# locale.icu.nation.kgz
source: Kyrgyzstan
de: Kirgistan

# locale.icu.nation.lao
source: Lao People`s Democratic Republic
de: Demokratische Volksrepublik Laos

# locale.icu.nation.lva
source: Latvia
de: Lettland

# locale.icu.nation.lbn
source: Lebanon
de: Libanon

# locale.icu.nation.lby
source: Libya
de: Libyen

# locale.icu.nation.ltu
source: Lithuania
de: Litauen

# locale.icu.nation.lux
source: Luxembourg
de: Luxemburg

# locale.icu.nation.mac
source: Macao
de: Macau

# locale.icu.nation.mdg
source: Madagascar
de: Madagaskar

# locale.icu.nation.mdv
source: Maldives
de: Malediven

# locale.icu.nation.mhl
source: Marshall Islands
de: Marshallinseln

# locale.icu.nation.mrt
source: Mauritania
de: Mauretanien

# locale.icu.nation.mex
source: Mexico
de: Mexiko

# locale.icu.nation.fsm
source: Micronesia (Federated States of)
de: Mikronesien (Föderierte Staaten von)

# locale.icu.nation.mda
source: Moldova (the Republic of)
de: Moldawien (Republik)

# locale.icu.nation.mng
source: Mongolia
de: Mongolei

# locale.icu.nation.mar
source: Morocco
de: Marokko

# locale.icu.nation.moz
source: Mozambique
de: Mosambik

# locale.icu.nation.mmr
source: Myanmar
de: Burma

# locale.icu.nation.nld
source: Netherlands
de: Niederlande

# locale.icu.nation.ncl
source: New Caledonia
de: Neu-Kaledonien

# locale.icu.nation.nzl
source: New Zealand
de: Neuseeland

# locale.icu.nation.nfk
source: Norfolk Island
de: Norfolkinsel

# locale.icu.nation.mkd
source: North Macedonia
de: Nordmazedonien

# locale.icu.nation.mnp
source: Northern Mariana Islands
de: Nördliche Marianen

# locale.icu.nation.nor
source: Norway
de: Norwegen
