Repository: porthd/timer
Catalog: Resources/Private/Language/locallang_cal.xlf
Languages: de

# locale.icu.nation.pse
source: Palestine, State of
de: Palästina, Bundesstaat

# locale.icu.nation.png
source: Papua New Guinea
de: Papua Neu-Guinea

# locale.icu.nation.phl
source: Philippines
de: Philippinen

# locale.icu.nation.pol
source: Poland
de: Polen

# locale.icu.nation.qat
source: Qatar
de: Katar

# locale.icu.nation.rou
source: Romania
de: Rumänien

# locale.icu.nation.rus
source: Russian Federation
de: Russische Föderation

# locale.icu.nation.rwa
source: Rwanda
de: Ruanda

# locale.icu.nation.blm
source: Saint Barthélemy
de: Sankt Barthélemy

# locale.icu.nation.shn
source: Saint Helena, Ascension and Tristan da Cunha
de: St. Helena, Himmelfahrt und Tristan da Cunha

# locale.icu.nation.kna
source: Saint Kitts and Nevis
de: St. Kitts und Nevis

# locale.icu.nation.lca
source: Saint Lucia
de: St. Lucia

# locale.icu.nation.maf
source: Saint Martin (French part)
de: Saint Martin (französischer Teil)

# locale.icu.nation.spm
source: Saint Pierre and Miquelon
de: St. Pierre und Miquelon

# locale.icu.nation.vct
source: Saint Vincent and the Grenadines
de: St. Vincent und die Grenadinen

# locale.icu.nation.stp
source: Sao Tome and Principe
de: Sao Tome und Principe

# locale.icu.nation.sau
source: Saudi Arabia
de: Saudi-Arabien

# locale.icu.nation.srb
source: Serbia
de: Serbien

# locale.icu.nation.syc
source: Seychelles
de: Seychellen

# locale.icu.nation.sgp
source: Singapore
de: Singapur

# locale.icu.nation.sxm
source: Sint Maarten (Dutch part)
de: Sint Maarten (niederländischer Teil)

# locale.icu.nation.svk
source: Slovakia
de: Slowakei

# locale.icu.nation.svn
source: Slovenia
de: Slowenien

# locale.icu.nation.slb
source: Solomon Islands
de: Salomon-Inseln

# locale.icu.nation.zaf
source: South Africa
de: Südafrika

# locale.icu.nation.sgs
source: South Georgia and the South Sandwich Islands
de: Süd-Georgien und die südlichen Sandwich-Inseln

# locale.icu.nation.ssd
source: South Sudan
de: Südsudan

# locale.icu.nation.esp
source: Spain
de: Spanien

# locale.icu.nation.sur
source: Suriname
de: Surinam

# locale.icu.nation.sjm
source: Svalbard and Jan Mayen
de: Spitzbergen und Jan Mayen

# locale.icu.nation.swe
source: Sweden
de: Schweden

# locale.icu.nation.che
source: Switzerland
de: Schweiz

# locale.icu.nation.syr
source: Syrian Arab Republic
de: Arabische Republik Syrien

# locale.icu.nation.twn
source: Taiwan (Province of China)
de: Taiwan, Provinz Chinas)

# locale.icu.nation.tjk
source: Tajikistan
de: Tadschikistan

# locale.icu.nation.tza
source: Tanzania, the United Republic of
de: Tansania, Vereinigte Republik

# locale.icu.nation.tgo
source: Togo
de: Gehen

# locale.icu.nation.tto
source: Trinidad and Tobago
de: Trinidad und Tobago

# locale.icu.nation.tun
source: Tunisia
de: Tunesien

# locale.icu.nation.tca
source: Turks and Caicos Islands
de: Turks- und Caicosinseln)

# locale.icu.nation.are
source: United Arab Emirates
de: Vereinigte Arabische Emirate

# locale.icu.nation.gbr
source: United Kingdom of Great Britain and Northern Ireland
de: Vereinigtes Königreich Großbritannien und Nordirland (das)

# locale.icu.nation.umi
source: United States Minor Outlying Islands
de: Kleinere abgelegene Inseln der Vereinigten Staaten

# locale.icu.nation.usa
source: United States of America
de: Vereinigte Staaten von Amerika

# locale.icu.nation.uzb
source: Uzbekistan
de: Usbekistan

# locale.icu.nation.ven
source: Venezuela (Bolivarian Republic of)
de: Venezuela (Bolivarianische Republik)

# locale.icu.nation.vgb
source: Virgin Islands (British)
de: Virgin Inseln, Britisch)

# locale.icu.nation.vir
source: Virgin Islands (U.S.)
de: Jungferninseln (USA)

# locale.icu.nation.wlf
source: Wallis and Futuna
de: Wallis und Futuna

# locale.icu.nation.esh
source: Western Sahara*
de: Westsahara*

# locale.icu.nation.yem
source: Yemen
de: Jemen

# locale.icu.nation.zmb
source: Zambia
de: Sambia

# locale.icu.nation.ala
source: Åland Islands
de: Åland-Inseln

# calendarDate.cult.greg.noConstitutionDay
source: Constitution Day
de: Tag der Verfassung

# calendarDate.christ.greg.roSanktAndreas
source: Saint Andrew's Day
de: Tag des heiligen Andreas

# calendarDate.christ.greg.roNationalHoliday
source: Romanian National Day
de: rumänischer Nationalfeiertag

# calendarDate.cult.jul.christmas
source: Christmas (Orthodox)
de: Weihnachten (orthodox)

# calendarDate.hist.greg.ruThirdNewYear
source: Third New Year's Day
de: Dritter Neujahrstag

# calendarDate.hist.greg.ruForthNewYear
source: Fourth New Year's Day
de: Vierter Neujahrstag

# calendarDate.hist.greg.ruFifthNewYear
source: Fifth New Year's Day
de: Fünfter Neujahrstag

# calendarDate.cult.greg.rwNationalHeroDay
source: Rwanda: National Heroes Day
de: Ruanda: Nationaler Heldentag

# calendarDate.hist.greg.ruDayOfDefendingOfNation
source: Russia: Defender of the Fatherland Day
de: Russland: Tag des Verteidigers des Vaterlandes

# calendarDate.cult.greg.rwGenocideAgainstTheTutsiMemorialDay
source: Rwanda: Remembrance Day for the Genocide of the Tutsis
de: Ruanda: Gendenktag zum Genozid an den Tutsis

# calendarDate.hist.greg.mdVictorySecWorldWar
source: Victory Day (Moldova)
de: Tag des Sieges (Moldavien)

# calendarDate.hist.greg.ruDayOfRussia
source: Day of Russia
de: Tag Russlands

# calendarDate.cult.greg.rwIndependenceDay
source: Rwanda: Independence Day
de: Ruanda: Tag der Unabhängigkeit

# calendarDate.cult.greg.rwLiberationDay
source: Rwanda: Liberation Day
de: Ruanda: Tag der Befreiung

# calendarDate.cult.greg.rwUmuganuraDay
source: Rwanda: Umuganura Day
de: Ruanda: Umuganura Tag

# calendarDate.cult.greg.mdIndependenceDay
source: Moldova: Independence Day
de: Moldavien: Unabhängigkeitstag

# calendarDate.cult.greg.mdNationalLanguageDay
source: Moldova: National Languages Day
de: Moldavien: Nationaler Sprachen Tag

# calendarDate.hist.greg.ruDayOfTheUnityOfThePeople
source: Russia: People's Unity Day
de: Russland: Tag der Einheit des Volkes
